{
  "youngster": {
    "encounter": {
      "1": "Hé ! Combat ?",
      "2": "Toi aussi tu débutes ?",
      "3": "Hé, j’me souviens pas de ta tête. Combat !",
      "4": "J’ai perdu, alors j’essaye de capturer d’autres Pokémon.\nHé, t’as l’air faible toi ! Allez, combat !",
      "5": "On s’connait ? J’ai comme un doute. Dans tous les cas, sympa de te rencontrer !",
      "6": "Allez, c’est parti !",
      "7": "Attention, me voilà !\nTu vas voir comment j’suis fort !",
      "8": "Coucou… Tu veux voir mes bô Pokémon ?",
      "9": "Trêve de mondanités. Ramène-toi quand tu le sens !",
      "10": "Baisse pas ta garde si tu veux pas pleurer d’avoir perdu face à un gamin.",
      "11": "J’ai tout donné pour élever mes Pokémon. Attention à toi si tu leur fait du mal !",
      "12": "Incroyable que t’y sois parvenu ! Mais la suite va pas être une partie de plaisir.",
      "12_female": "Incroyable que t’y sois parvenue ! Mais la suite va pas être une partie de plaisir.",
      "13": "Les combats sont éternels ! Bienvenue dans un monde sans fin !"
    },
    "victory": {
      "1": "Hé, mais t’es trop fort !",
      "1_female": "Hé, mais t’es trop forte !",
      "2": "En vrai j’avais aucune chance hein ?",
      "3": "J’te retrouverai un jour, et là j’te battrai !",
      "4": "Arg… J’ai plus aucun Pokémon.",
      "5": "Non… IMPOSSIBLE ! Pourquoi j’ai encore perdu…",
      "6": "Non ! J’ai perdu !",
      "7": "Waah ! T’es trop incroyable ! J’suis bouche bée !",
      "8": "Pourquoi… Comment… Pourtant on est les plus forts, mes Pokémon et moi…",
      "9": "J’perdrai pas la prochaine fois ! Remettons ça un jour !",
      "10": "Weeeesh ! Tu vois que j’suis qu’un gamin ? C’est pas juste de me bully comme ça !",
      "11": "Tes Pokémon sont trop incroyables !\n… P’tit échange ?",
      "12": "Je me suis fait un peu aider plus tôt, mais de quel taf je parlais ?",
      "13": "Ahaha ! Et voilà, ça y est !\nT’es déjà comme chez toi dans ce monde !"
    }
  },
  "lass": {
    "encounter": {
      "1": "Affrontons-nous, d’accord ?",
      "2": "T’as l’air d’un nouveau Dresseur. Battons nous !",
      "2_female": "T’as l’air d’une nouvelle Dresseuse. Battons nous !",
      "3": "Je te connais pas. Ça te dis de te battre ?",
      "4": "Prenons du bon temps avec ce combat Pokémon !",
      "5": "Je vais t’apprendre à te battre avec tes Pokémon !",
      "6": "Un combat doit toujours être pris au sérieux.\nT’es prêt à te battre ?",
      "6_female": "Un combat doit toujours être pris au sérieux.\nT’es prête à te battre ?",
      "7": "Tu seras pas jeune éternellement. T’as qu’une chance pendant un combat. Bientôt, tu seras plus qu’un souvenir.",
      "8": "Tu ferais mieux d’y aller doucement avec moi. Mais je vais me battre sérieusement !",
      "9": "Je m’ennuie à l’école. Y’a rien à y faire. *Baille*\nJe me bats juste pour passer le temps."
    },
    "victory": {
      "1": "Wah, c’était impressionnant ! J’ai encore beaucoup à apprendre.",
      "2": "Je ne pensais pas que je perdrais comme ça…",
      "2_female": "Je pensais pas que je perdrais comme ça…",
      "3": "J’espère que j’aurai ma revanche un jour.",
      "4": "C’était super amusant ! Mais ce combat m’a épuisée…",
      "5": "Tu m’as appris une belle leçon ! T’es vraiment incroyable !",
      "6": "Vraiment ? J’ai perdu… ? C’est des choses qui arrivent, ça me déprime mais tu es vraiment très cool.",
      "6_female": "Vraiment ? J’ai perdu… ? C’est des choses qui arrivent, ça me déprime mais t’es vraiment très cool.",
      "7": "J’ai pas besoin de ce genre de souvenirs.\n*Suppression de mémoire en cours…*",
      "8": "Hé ! Je t’avais dit d’y aller doucement avec moi ! Mais t’es vraiment si cool quand tu te bats sérieusement…",
      "9": "J’en ai marre des combats Pokémon…\nJe vais chercher d’autres trucs à faire…"
    }
  },
  "breeder": {
    "encounter": {
      "1": "Qu’ils soient obéissants ou égoïstes… Les Pokémon ont des caractéristiques uniques.",
      "2": "Même si mes choix et ma personnalité ne sont pas fous, je pense quand même bien avoir élevé mes Pokémon.",
      "3": "Hum, t’es pas trop laxiste avec tes Pokémon ?\nTrop les chouchouter n’est pas bon."
    },
    "victory": {
      "1": "Il est primordial de nourrir et développer toutes les caractéristiques de chaque Pokémon.",
      "2": "Contrairement à moi, ces Pokémon ont un bon fond.",
      "3": "Trop d’éloges peut ruiner les Pokémon et les gens."
    },
    "defeat": {
      "1": "Tu ne devrais pas t’énerver sur tes Pokémon, même après une défaite.",
      "2": "Alors ? Pas mal mes Pokémon, hein ? Je suis fait pour ça.",
      "3": "Peu importe à quel point t’aimes tes Pokémon, il faut toujours de la discipline s’ils se comportent mal."
    }
  },
  "breeder_female": {
    "encounter": {
      "1": "Les Pokémon ne trahissent jamais. Ils te rendront toujours l’amour que tu leur donne.",
      "2": "Puis-je te donner une astuce pour mieux élever tes Pokémon ?",
      "3": "J’ai élevé mes Pokémon en utilisant une méthode très spéciale."
    },
    "victory": {
      "1": "Arg… C’était pas supposé se passer comme ça. Leur ai-je administré la mauvaise préparation ?",
      "2": "Comment ça a pu arriver…\nAvec quoi nourris-tu tes Pokémon ?",
      "3": "Si je perds, c’est juste pour te dire que je tuais le temps. Mon ego n’est absolument pas touché…"
    },
    "defeat": {
      "1": "C’est la preuve que mes Pokémon reconnaissent tout mon amour.",
      "2": "Le seul secret derrière des Pokémon bien entrainés, c’est surtout d’en capturer des bons.",
      "3": "La force des Pokémon dépend de ta capacité à savoir les élever correctement."
    }
  },
  "fisherman": {
    "encounter": {
      "1": "Aaah non ! J’avais une touche !\nTu comptes faire quoi pour arranger ça ?",
      "2": "Bouge de là ! Tu fais peur aux Pokémon !",
      "3": "Voyons si t’arrives à ferrer une victoire !"
    },
    "victory": {
      "1": "Vas-y là, oublie.",
      "2": "La prochaine fois, je vais me repêcher !",
      "3": "Je présume que j’ai sous-estimé les courants…"
    }
  },
  "fisherman_female": {
    "encounter": {
      "1": "Oh la belle prise !",
      "2": "Ma ligne est en place, prête à ferrer le succès !",
      "3": "Prête à faire des vagues !"
    },
    "victory": {
      "1": "Je suppose que je vais avoir besoin d’un plus gros hameçon.",
      "2": "La ligne s’est brisée, j’ai pas pu la ferrer…",
      "3": "Attends que j’aiguise mes hameçons pour la revanche !"
    }
  },
  "swimmer": {
    "encounter": {
      "1": "C’est l’heure de plonger dans le vif !",
      "2": "C’est le moment de surfer sur les vagues de la victoire !",
      "3": "Je vais t’éclabousser de mon talent !"
    },
    "victory": {
      "1": "Tu m’as complètement séché",
      "2": "Il semblerait que ce soit celles de la défaite…",
      "3": "Retour sur la terre ferme je suppose"
    }
  },
  "backpacker": {
    "encounter": {
      "1": "Fais ton sac, on y va !",
      "2": "Voyons si t’arrives à garder le rythme !",
      "3": "Accélère le pas, camarade !",
      "4": "J’ai passé 20 ans à la recherche de moi-même…\nMais où suis-je ?"
    },
    "victory": {
      "1": "J’ai trébuché !",
      "2": "Ah, je crois que je me suis paumé.",
      "3": "Ah, une impasse !",
      "4": "Hé ! Attends une seconde…\nTu saurais pas qui je suis ?"
    }
  },
  "ace_trainer": {
    "encounter": {
      "1": "T’as l’air plutôt confiant.",
      "1_female": "T’as l’air plutôt confiante.",
      "2": "Tes Pokémon… Montre-les-moi…",
      "3": "Les gens pensent que je suis fort par que je suis un Topdresseur.",
      "4": "T’es au courant de ce que ça signifie d’être un Topdresseur ?"
    },
    "victory": {
      "1": "Très bien… T’as de bons Pokémon…",
      "2": "Quoi ?! Mais c’est moi le génie des combats !",
      "3": "Évidemment que t’es le personnage principal !",
      "4": "OK ! OK ! Tu pourrais être un Topdresseur !",
      "4_female": "OK ! OK ! Tu pourrais être une Topdresseuse !"
    },
    "defeat": {
      "1": "Je me dévoue corps et âme aux combats Pokémon !",
      "2": "Comme prévu… Vraiment aucune surprise…",
      "3": "Et moi qui pensais qu’en grandissant, j’allais rester frêle et fragile, à me briser à la moindre étreinte.",
      "4": "Évidemment que je suis fort et encore moins un perdant. C’est important de gagner avec grâce."
    }
  },
  "parasol_lady": {
    "encounter": {
      "1": "Honorons ce terrain de combat avec élégance et équilibre !"
    },
    "victory": {
      "1": "Mon élégance demeure inébranlable !"
    }
  },
  "rocket_grunt": {
    "encounter": {
      "1": "Nous sommes de retour !",
      "2": "Ça bosse dur, ici ! Alors du balai !",
      "3": "File-nous tes Pokémon ou tu vas gouter à la colère de la Team Rocket !",
      "4": "Sois témoin de ce qu’est une vraie terreur de la Team Rocket!",
      "5": "Hé gamin ! Moi être guy member of la Team Rocket !",
      "5_female": "Hé gamine ! Moi être guy member of la Team Rocket !"
    },
    "victory": {
      "1": "Une fois de plus la Team Rocket s’envole vers d’autres cieux !",
      "2": "Mince! J’ai laissé tomber\nla Clé Ascenseur !",
      "3": "J’ai tout foiré !",
      "4": "Mes compagnons vont me venger !",
      "5": "Toi dire quoi ? Forget que tu m’as vu !\nYou n’as rien seen !"
    }
  },
  "magma_grunt": {
    "encounter": {
      "1": "N’espère pas recevoir de la pitié si tu te mets sur le chemin de la Team Magma !",
      "2": "Ne te mêle pas de nos affaires ! On va rendre ce monde meilleur !",
      "3": "Hors de mon chemin ! La Team Magma n’a pas de temps pour les gamins !",
      "4": "J’espère que t’as quelques marshmallows, car ça va chauffer !",
      "5": "On va utiliser le puissance d’un volcan ! Ça va être… explosif ! Tu l’as… ? Héhé !"
    },
    "victory": {
      "1": "Je…?\nJ’ai perdu ?!",
      "2": "Je peux pas croire que j’ai pas pris mon déjeuner juste pour ça…",
      "3": "Impossible ! T’es qu’un gosse !",
      "3_female": "Impossible ! T’es qu’une gosse !",
      "4": "Aahhh…\nJ’aurais dû directement rentrer à la planque…",
      "5": "Tu m’as démoli… Tu crois que le boss va suspendre mon salaire ?"
    }
  },
  "aqua_grunt": {
    "encounter": {
      "1": "Aucune pitié si tu te mets sur le chemin de la Team Aqua, même pour un gamin !",
      "2": "Grrr…\nTu as eu le culot de t’opposer à la Team Aqua !",
      "3": "Je vais te liquéfier !\nEt ce sera pas qu’à cause des mes Pokémon Eau !",
      "4": "Nous, la Team Aqua, existons pour le bien commun !",
      "5": "Prépare-toi à te faire emporter par le courant de…\nEuh… Mes Pokémon ! Oui, mes Pokémon !"
    },
    "victory": {
      "1": "Comment ça ?",
      "2": "Ah, j’avais pas prévu d’être gêné par un mouflet qui se mêle de tout !",
      "3": "J’ai perdu ?! Super, j’ai plus qu’à nager jusqu’à la planque maintenant…",
      "4": "Oh non quelle angoisse…\nLe boss va me démonter…",
      "5": "Je suis battu… Tu penses que le boss va me faire subir le supplice de la planche ?…"
    }
  },
  "galactic_grunt": {
    "encounter": {
      "1": "Ne te mets pas en travers de la Team Galaxie !",
      "2": "Sois témoin de la puissance de notre technologie et du futur qui se profile !",
      "3": "Au nom de la Team Galaxie, j’éliminerai quiconque se mettra sur notre route !",
      "4": "Prépare ta défaite !",
      "5": "J’espère que t’es prêt à te prendre une raclée de l’espace !",
      "5_female": "J’espère que t’es prête à te prendre une raclée de l’espace !"
    },
    "victory": {
      "1": "Désactivation…",
      "2": "Cet échec n’est qu’une poussière face à nos ambitions débordantes.",
      "3": "Notre projet est bien plus important que cette défaite.",
      "4": "Comment ?!",
      "5": "Note à moi-même :\nM’entrainer aux combats Pokémon. Ça urge…"
    }
  },
  "plasma_grunt": {
    "encounter": {
      "1": "Pas de quartiers à quiconque ne suit pas notre idéal !",
      "2": "Si je gagne, tu relâches tous tes Pokémon !",
      "3": "Si tu te mets en travers de la Team Plasma, je m’occuperai de toi personnellement !",
      "4": "La Team Plasma va libérer les Pokémon de tous les humains égoïstes dans ton genre !",
      "5": "Nos coupes sont lunaires… Mais en combat ?\nTu vas vite le découvrir."
    },
    "victory": {
      "1": "Plasmaaaaaaaaa !",
      "2": "Comment ai-je pu perdre…",
      "3": "… Ce Pokémon est nul, j’vais aller en voler de meilleurs !",
      "4": "Les plans ambitieux connaissent toujours leurs lots d’interruptions.",
      "5": "C’est mauvais… MAUVAIS MAUVAIS MAUVAIS MAUVAIS !\nVa falloir battre en retraite, c’est la méga cata !"
    }
  },
  "flare_grunt": {
    "encounter": {
      "1": "Tes Pokémon ne sont pas dignes de l’élégance de la Team Flare.",
      "2": "T’as des lunettes de soleil j’espère ?\nCar prépare-toi à être ébloui !",
      "2_female": "T’as des lunettes de soleil j’espère ?\nCar prépare-toi à être éblouie !",
      "3": "La Team Flare va purifier ce monde de toute imperfection !",
      "4": "Prépare-toi à découvrir l’indiscutable sens du style de la Team Flare !",
      "5": "La mode, c’est important !"
    },
    "victory": {
      "1": "Mon futur n’a pas l’air si radieux.",
      "2": "Les combats semblent être plus complexes que je le pensais.\nRetour aux planches à dessin.",
      "3": "Ehhhh ?! J’ai perdu ?!",
      "4": "Même dans la défaite, l’élégance de la Team Flare continue de rayonner sur ce monde.",
      "5": "J’appelle pas ça perdre, j’appelle ça échouer avec panache !"
    }
  },
  "aether_grunt": {
    "encounter": {
      "1": "Je vais te mettre ta raclée !",
      "2": "J’en ai rien à faire que tu sois une gosse. Tu vas tutoyer les étoiles si tu nous menaces !",
      "2_female": "J’en ai rien à faire que tu sois une gosse. Tu vas tutoyer les étoiles si tu nous menaces !",
      "3": "J’ai pour ordre de ne laisser passer aucun Dresseur, peu importe qui c’est !",
      "4": "Je vais te montrer le pouvoir du Paradis Æther !",
      "5": "Maintenant que t’es au courant de ce qu’il se passe au cœur du Paradis Æther, fais-moi une faveur et disparait !"
    },
    "victory": {
      "1": "C’est plutôt toi qui devrait m’apprendre à en mettre…",
      "2": "Pardon ? J’ai pas compris…",
      "3": "Peu importe les ordres, jamais j’aurais pu te retenir en fait…",
      "4": "Mhh… Il semblerait que j’ai perdu.",
      "5": "C’est plutôt moi qui va disparaitre je crois."
    }
  },
  "faba": {
    "encounter": {
      "1": "Moi, Directeur Saubohne, je vais te montrer de quel bois je me chauffe !",
      "2": "Donc là, l’homme supposé être la dernière ligne défense du Paradis Æther doit affronter un mioche ?",
      "2_female": "Donc là, l’homme supposé être la dernière ligne défense du Paradis Æther doit affronter un mioche ?",
      "3": "S’il n’y a qu’un seul nom à retenir au sein de la Fondation Æther, c’est le mien : Saubohne !"
    },
    "victory": {
      "1": "Gloups !",
      "2": "Malheur ! J’ai perdu face à un simple enfant ?!",
      "2_female": "Malheur ! J’ai perdu face à une simple enfant ?!",
      "3": "J’ai HORREUR des enfants !"
    }
  },
  "skull_grunt": {
    "encounter": {
      "1": "Oush oush ! On est pas méchants, sauf si tu viens nous allumer la mèche-han !",
      "2": "Ce manque de respect, j’hallucine ! T’es allé trop loin, le mioche !",
      "2_female": "Ce manque de respect, j’hallucine ! T’es allée trop loin, la mioche !",
      "3": "On est juste des gars et des meufs normaux, on voit un Pokémon on le prend !",
      "4": "Pourquoi tu te la joue comme ça ? C'est avec tes dents que t’vas jouer frérot.",
      "4_female": "Pourquoi tu te la joue comme ça ? C'est avec tes dents que t’vas jouer ma reus.",
      "5": "Cousin, écoute-nous bien ! ♪\nSe taper dessus, ça sert à rien ! ♪\n$Tu t’incrustes chez nous, ça s’fait pas ! ♪\n$Mais on est sympa, on a un plan pour toi ! ♪",
      "5_female": "Cousine, écoute-nous bien ! ♪\nSe taper dessus, ça sert à rien ! ♪\n$Tu t’incrustes chez nous, ça s’fait pas ! ♪\n$Mais on est sympa, on a un plan pour toi ! ♪"
    },
    "victory": {
      "1": "Hein ? C’est déjà terminé ?",
      "2": "… Ça craint grave ! On s’tire !",
      "3": "Ouais de toute on en avait pas b’soin de ton Pokémon… Ah ah…",
      "4": "Ouh là, c’est bon, j’en demandais pas tant…",
      "5": "On pèse plus que des Pokémon, t’entends ?\nAlors tu vas nous respecter, oush !"
    }
  },
  "plumeria": {
    "encounter": {
      "1": "Tsk. T’es un gamin tout ce qu’il y a de plus banal, en fait.",
      "1_female": "Tsk. T’es une gamine tout ce qu’il y a de plus banal, en fait.",
      "2": "Abrutis de sbires. Trop incompétents pour arriver à se débarasser de gamins…",
      "3": "Si tu touches encore à un cheveu de mes lascars, tu vas pas comprendre c’qui t’arrive !"
    },
    "victory": {
      "1": "Tsk. T’es pas mauvais. J’te l’accorde.",
      "1_female": "Tsk. T’es pas mauvaise. J’te l’accorde.",
      "2": "Tsk. J’dois reconnaitre que t’en as dans le ventre.\n$Maintenant, j’comprends pourquoi mes gars n’arrêtent pas de se faire battre par toi.",
      "3": "Tsk. J’crois que j'ai plus qu’à assumer ma défaite."
    }
  },
  "macro_grunt": {
    "encounter": {
      "1": "Hop hop hop ! Terminus !",
      "2": "T’es un Dresseur n’est-ce pas ?\n$J’ai bien peur ce que ne soit pas une excuse suffisante pour nous interrompre dans notre travail.",
      "2_female": "T’es une Dresseuse n’est-ce pas ?\n$J’ai bien peur ce que ne soit pas une excuse suffisante pour nous interrompre dans notre travail.",
      "3": "Je travaille à Macro Cosmos Assurances !\nBesoin d’une assurance-vie ?"
    },
    "victory": {
      "1": "Je n’ai d’autre choix que respectueusement me retirer.",
      "2": "Mon argent de poche…\nPlus qu’à manger des pâtes pour la fin du mois…",
      "3": "Chez Macro Cosmos, rien n’est comparable à notre dévotion au travail !"
    }
  },
  "oleana": {
    "encounter": {
      "1": "Je ne laisserai personne interférer avec les projets du président Shehroz.",
      "2": "Je vois que vous avez su vous défaire de mes subalternes.\n$Mais assez joué. Il est temps de rentrer chez vous, maintenant.",
      "3": "Je gagnerai en votre nom, monsieur le président."
    },
    "victory": {
      "1": "*soupir* Comment ai-je fait pour perdre ainsi… ?\nJe ne suis vraiment pas à la hauteur…",
      "2": "Ah ! Quelle erreur… Je n’aurais pas dû sous-estimer un Dresseur de ton calibre…",
      "2_female": "Ah ! Quelle erreur… Je n’aurais pas dû sous-estimer une Dresseuse de ton calibre…",
      "3": "*soupir* Je suis fatiguée parton…"
    }
  },
  "rocket_boss_giovanni_1": {
    "encounter": {
      "1": "Bien. Je dois admettre que je suis impressionné de te voir ici !"
    },
    "victory": {
      "1": "QUOI ? IMPOSSIBLE !"
    },
    "defeat": {
      "1": "Retiens bien. Ton incapacité à évaluer ta propre force est\nla démonstration claire que tu n’es encore qu’un gamin.",
      "1_female": "Retiens bien. Ton incapacité à évaluer ta propre force est\nla démonstration claire que tu n’es encore qu’une gamine."
    }
  },
  "rocket_boss_giovanni_2": {
    "encounter": {
      "1": "Mes anciens collaborateurs m’attendent.\nComptes-tu m’en empêcher ?"
    },
    "victory": {
      "1": "Comment c’est possible… ? Le grand dessein de la Team Rocket n’est plus qu’une illusion…"
    },
    "defeat": {
      "1": "La Team Rocket renaitra, et je dominerai le monde !"
    }
  },
  "magma_boss_maxie_1": {
    "encounter": {
      "1": "Je vais t’enterrer de mes propres mains.\nJ’espère que t’apprécieras cet honneur !"
    },
    "victory": {
      "1": "Gnn… ! Tu… T’as du répondant…\nCe sentiment d’être à la traine, de si peu…"
    },
    "defeat": {
      "1": "La Team Magma vaincra !"
    }
  },
  "magma_boss_maxie_2": {
    "encounter": {
      "1": "T’es le dernier rempart entravant mes objectifs. Prépare-toi à mon ultime riposte ! Hahahaha !"
    },
    "victory": {
      "1": "Ce… Ce n’est pas… Gnn…"
    },
    "defeat": {
      "1": "L’heure est venue…\nJe vais transformer cette planète en paradis pour l’humanité."
    }
  },
  "aqua_boss_archie_1": {
    "encounter": {
      "1": "Je suis le Leader de la Team Aqua.\nJ’ai bien peur que pour toi, ce soit fin de parcours."
    },
    "victory": {
      "1": "Retrouvons-nous.\nJe me souviendrai de ton visage."
    },
    "defeat": {
      "1": "Magnifique !\nPlus rien ne peut nous retenir !"
    }
  },
  "aqua_boss_archie_2": {
    "encounter": {
      "1": "J’ai attendu ce moment depuis si longtemps.\nVoici la vraie puissance de la Team Aqua !"
    },
    "victory": {
      "1": "Comme si j’y avait cru…"
    },
    "defeat": {
      "1": "Je rendrai à ce monde sa pureté originelle !"
    }
  },
  "galactic_boss_cyrus_1": {
    "encounter": {
      "1": "Tu t’es senti obligé de venir ici dans un acte vide de sens. Je vais te le faire regretter.",
      "1_female": "Tu t’es sentie obligée de venir ici dans un acte vide de sens. Je vais te le faire regretter."
    },
    "victory": {
      "1": "Intéressant. Et plutôt curieux."
    },
    "defeat": {
      "1": "Je le créerai, mon nouveau monde…"
    }
  },
  "galactic_boss_cyrus_2": {
    "encounter": {
      "1": "Nous y revoilà. Il semblerait que nos destinées soient entremêlées. Il est l’heure d’y mettre un terme."
    },
    "victory": {
      "1": "Comment. Comment ?\nCOMMENT ?!"
    },
    "defeat": {
      "1": "Adieu."
    }
  },
  "plasma_boss_ghetsis_1": {
    "encounter": {
      "1": "Je n’accepterai pas qu’on me barre la route !\nPeu importe qui fait quoi !"
    },
    "victory": {
      "1": "Comment ? Je suis le leader de la Team Plasma !\nJe suis parfait !"
    },
    "defeat": {
      "1": "Je suis le parfait monarque d’un monde parfait !\nHahaha !"
    }
  },
  "plasma_boss_ghetsis_2": {
    "encounter": {
      "1": "Viens ! Je veux voir ton visage à l’instant même où l’espoir quittera ton corps !"
    },
    "victory": {
      "1": "Mes calculs… Non ! Mes plans étaient parfaits !\nCe monde devrait être mien !"
    },
    "defeat": {
      "1": "Kyurem ! Fusiorption !!!"
    }
  },
  "flare_boss_lysandre_1": {
    "encounter": {
      "1": "Comptes-tu m’arrêter ? Prouve-le."
    },
    "victory": {
      "1": "T’es venu m’arrêter. Mais je te demande d’attendre."
    },
    "defeat": {
      "1": "Les Pokémon… Ne devraient plus exister."
    }
  },
  "flare_boss_lysandre_2": {
    "encounter": {
      "1": "Ton futur ou le mien…\nVoyons lequel mérite plus d’aboutir."
    },
    "victory": {
      "1": "Ohhhh… !"
    },
    "defeat": {
      "1": "Les ignorants sans aucune vision n’auront donc de cesse de souiller ce monde."
    }
  },
  "brock": {
    "encounter": {
      "1": "Mon expertise des types Roche va te mettre au sol ! En garde !",
      "2": "Tu veux toujours te battre avec moi ? Même en sachant que tu vas perdre ?",
      "3": "Laisse-moi de montrer la véritable force de mes Pokémon Roche !"
    },
    "victory": {
      "1": "J’étais trop sûr de moi, c’est pour ça que j’ai perdu.",
      "2": "Ce monde est vaste ! Je suis honoré d’avoir pu t’affronter.",
      "3": "Peut-être bien que je n’aurais pas dû abandonner ma vocation d’Éleveur…"
    },
    "defeat": {
      "1": "La défense est la meilleure des attaques !\nTelle est ma méthode !",
      "2": "Viens étudier des roches avec moi la prochaine fois si tu veux apprendre à mieux les aborder !",
      "3": "Tout ce temps à voyager autour du monde paie enfin !"
    }
  },
  "misty": {
    "encounter": {
      "1": "Ma tactique ? Attaquer avec des Pokémon Eau !",
      "2": "Je vais te prouver le tsunami que sont mes Pokémon aquatiques !",
      "3": "Mon rêve, c’était de voyager et de défier des Dresseurs super forts. Seras-tu à la hauteur ?"
    },
    "victory": {
      "1": "OK. T’es pas naze… Je le reconnais…",
      "2": "Pfff… T’as juste eu de la chance hein ?!",
      "3": "Ouah ! T’es super balèze !"
    },
    "defeat": {
      "1": "Qu’en dis-tu? C’est ça, la puissance des Pokémon Eau !",
      "2": "J’espère que t’as pris note des élégantes techniques de nage de mes Pokémon !",
      "3": "Tes Pokémon ne jouent visiblement pas dans le même bassin…"
    }
  },
  "lt_surge": {
    "encounter": {
      "1": "T’as pas froid aux yeux, soldat ! Les combats Pokémon, c’est la guerre !",
      "2": "Tu as du guts pour venir me fight ici ! Je vais te shock !",
      "3": "Compte tes dents, tu vas morfler !\nMes Pokémon Électrik vont t’atomiser !"
    },
    "victory": {
      "1": "Whoo ! T’iras loin toi.",
      "2": "Oh noes ! Mes tricks électriques sont à plat…\nYou are very fortiche!",
      "3": "Tu es very costaud ! Je vais training very dur mes Pokémon, moi too, et on sera Number One !"
    },
    "defeat": {
      "1": "Oh yeah !\nMes Pokémon Électrik sont les best du monde !",
      "2": "Oh yeah, baby ! I am trop fort !",
      "3": "Une combat Pokémon, c’est comme une guerre et t’as eu droit à une bataille de premier ordre !"
    }
  },
  "erika": {
    "encounter": {
      "1": "Il fait beau, aujourd’hui, n’est-ce pas… ?\nQuoi un combat… ? Très bien…",
      "2": "L’arrangement floral est ma spécialité, et mes Pokémon sont de type Plante. Quoi ? Tu veux te battre ?",
      "3": "Il fait beau… Le soleil brille… Les plantes bourgeonnent… Je m’ennuie…",
      "4": "Voir un tel jardin rempli de fleurs est si apaisant…"
    },
    "victory": {
      "1": "Bien joué, c’est mérité.",
      "2": "Dommage, on s’amusait si bien…",
      "3": "Oh non, le combat est terminé…",
      "4": "Aaah, ça fait du bien !\nMerci, j’en avais besoin."
    },
    "defeat": {
      "1": "J’ai failli m’endormir…",
      "2": "Oh non… Mes Pokémon Plante ont l’air de t’avoir bien endormi…",
      "2_female": "Oh non… Mes Pokémon Plante ont l’air de t’avoir bien endormie…",
      "3": "Ce combat était si apaisant…",
      "4": "Oh non… C’est tout ?"
    }
  },
  "alder": {
    "encounter": {
      "1": "Prépare-toi pour un combat contre le meilleur Dresseur d’Unys !"
    },
    "victory": {
      "1": "Bien joué ! Tu as sans aucun doute un talent inégalé."
    },
    "defeat": {
      "1": "Une brise fraiche traverse mon cœur…\n$Quel effort extraordinaire !"
    }
  },
  "kieran": {
    "encounter": {
      "1": "Grâce à un travail acharné, je deviens de plus en plus fort !\n$Je ne perdrai pas."
    },
    "victory": {
      "1": "Je n’y crois pas…\n$Quel combat amusant et palpitant !"
    },
    "defeat": {
      "1": "Eh beh, quel combat !\n$Il est temps pour toi de t’entrainer encore plus dur."
    }
  },
  "rival": {
    "encounter": {
      "1": "@c{smile}Ah, je te cherchais ! Je savais que t’étais pressée de partir, mais je m’attendais quand même à un au revoir…\n$@c{smile_eclosed}T’as finalement décidé de réaliser ton rêve ?\nJ’ai peine à y croire.\n$@c{serious_smile_fists}Vu que t’es là, ça te dis un petit combat ?\nJe voudrais quand même m’assurer que t’es prête.\n$@c{serious_mopen_fists}Surtout ne te retiens pas et donne-moi tout ce que t’as !"
    },
    "victory": {
      "1": "@c{shock}Wah… Tu m’as vraiment lavé.\nT’es vraiment une débutante ?\n$@c{smile}T’as peut-être eu de la chance, mais…\nPeut-être que t’arriveras jusqu’au bout du chemin.\n$D’ailleurs, le prof m’a demandé de te filer ces objets.\nIls ont l’air sympas.\n$@c{serious_smile_fists}Bonne chance à toi !"
    }
  },
  "rival_female": {
    "encounter": {
      "1": "@c{smile_wave}Ah, te voilà ! Je t’ai cherché partout !\n@c{angry_mopen}On oublie de dire au revoir à sa meilleure amie ?\n$@c{smile_ehalf}T’as décidé de réaliser ton rêve, hein ?\nCe jour est donc vraiment arrivé…\n$@c{smile}Je veux bien te pardonner de m’avoir oubliée,\nà une condition. @c{smile_wave_wink}Que tu m’affronte !\n$@c{angry_mopen}Donne tout ! Ce serait dommage que ton aventure finisse avant d’avoir commencé, hein ?"
    },
    "victory": {
      "1": "@c{shock}Tu viens de commencer et t’es déjà si fort ?!@d{96}\n@c{angry}T’as triché non ? Avoue !\n$@c{smile_wave_wink}J’déconne !@d{64} @c{smile_eclosed}J’ai perdu dans les règles…\nJ’ai le sentiment que tu vas très bien t’en sortir.\n$@c{smile}D’ailleurs, le prof veut que je te donne ces quelques objets. Ils te seront utiles, pour sûr !\n$@c{smile_wave}Fais de ton mieux, comme toujours !\nJe crois fort en toi !"
    }
  },
  "rival_2": {
    "encounter": {
      "1": "@c{smile}Hé, toi aussi t’es là ?\n@c{smile_eclosed}Toujours invaincue, hein… ?\n$@c{serious_mopen_fists}Je sais que j’ai l’air de t’avoir suivie ici, mais c’est pas complètement vrai.\n$@c{serious_smile_fists}Pour être honnête, ça me démangeait d’avoir une revanche depuis que tu m’as battu.\n$Je me suis beaucoup entrainé, alors sois sure que je vais pas retenir mes coups cette fois.\n$@c{serious_mopen_fists}Et comme la dernière fois, ne te retiens pas !\nC’est parti !"
    },
    "victory": {
      "1": "@c{neutral_eclosed}Oh. Je crois que j’ai trop pris la confiance.\n$@c{smile}Pas grave, c’est OK. Je me doutais que ça arriverait.\n@c{serious_mopen_fists}Je vais juste devoir encore plus m’entrainer !\n\n$@c{smile}Ah, et pas que t’aies réellement besoin d’aide, mais j’ai ça en trop sur moi qui pourrait t’intéresser.\n\n$@c{serious_smile_fists}Mais n’espère plus en avoir d’autres !\nJe peux pas passer mon temps à aider mon adversaire.\n$@c{smile}Bref, prends soin de toi !"
    }
  },
  "rival_2_female": {
    "encounter": {
      "1": "@c{smile_wave}Hé, sympa de te croiser ici. T’as toujours l’air invaincu. @c{angry_mopen}Eh… Pas mal !\n$@c{angry_mopen}Je sais à quoi tu penses et non, je t’espionne pas.\n@c{smile_eclosed}C’est juste que j’étais aussi dans le coin.\n$@c{smile_ehalf}Heureuse pour toi, mais je veux juste te rappeler que c’est pas grave de perdre parfois.\n$@c{smile}On apprend de nos erreurs, souvent plus que si on ne connaissait que le succès.\n$@c{angry_mopen}Dans tous les cas je me suis bien entrainée pour cette revanche, t’as intérêt à tout donner !"
    },
    "victory": {
      "1": "@c{neutral}Je… J’étais pas encore supposée perdre…\n$@c{smile}Bon. Ça veut juste dire que je vais devoir encore plus m’entrainer !\n$@c{smile_wave}J’ai aussi ça en rab pour toi !\n@c{smile_wave_wink}Inutile de me remercier ~.\n$@c{angry_mopen}C’étaient les derniers, terminé les cadeaux après ceux-là !\n$@c{smile_wave}Allez, tiens le coup !"
    },
    "defeat": {
      "1": "Je suppose que c’est parfois normal de perdre…"
    }
  },
  "rival_3": {
    "encounter": {
      "1": "@c{smile}Hé, mais qui voilà ! Ça fait un bail.\n@c{neutral}T’es… toujours invaincue ? Incroyable.\n$@c{neutral_eclosed}Tout est devenu un peu… étrange.\nC’est plus pareil sans toi au village.\n$@c{serious}Je sais que c’est égoïste, mais j’ai besoin d’expier ça.\n@c{neutral_eclosed}Je crois que tout ça te dépasse.\n$@c{serious}Ne jamais perdre, c’est juste irréaliste.\nGrandir, c’est parfois aussi savoir perdre.\n$@c{neutral_eclosed}T’as un beau parcours, mais il y a encore tellement à venir et ça va pas s’arranger. @c{neutral}T’es prête pour ça ?\n$@c{serious_mopen_fists}Si tu l’es, alors prouve-le."
    },
    "victory": {
      "1": "@c{angry_mhalf}C’est lunaire… J’ai presque fait que m’entrainer…\nAlors pourquoi il y a encore un tel écart entre nous ?"
    }
  },
  "rival_3_female": {
    "encounter": {
      "1": "@c{smile_wave}Ça fait une éternité ! Toujours debout hein ?\n@c{angry}Tu commences à me pousser à bout là. @c{smile_wave_wink}T’inquiètes j’déconne !\n$@c{smile_ehalf}Mais en vrai, ta maison te manque pas ? Ou… Moi ?\nJ… Je veux dire… Tu me manques vraiment beaucoup.\n$@c{smile_eclosed}Je te soutiendrai toujours dans tes ambitions, mais la vérité est que tu finiras par perdre un jour ou l’autre.\n$@c{smile}Quand ça arrivera, je serai là pour toi, comme toujours.\n@c{angry_mopen}Maintenant, montre-moi à quel point t’es devenu fort !"
    },
    "victory": {
      "1": "@c{shock}Après tout ça… Ça te suffit toujours pas… ?\nTu reviendras jamais à ce rythme…"
    },
    "defeat": {
      "1": "T’as fait de ton mieux.\nAllez, rentrons à la maison."
    }
  },
  "rival_4": {
    "encounter": {
      "1": "@c{neutral}Hé.\n$Je vais pas y aller par quatre chemins avec toi.\n@c{neutral_eclosed}Je suis là pour gagner. Simple, basique.\n$@c{serious_mhalf_fists}J’ai appris à maximiser tout mon potentiel en m’entrainant d’arrachepied.\n$@c{smile}C’est fou tout le temps que tu peux te dégager si tu dors pas en sacrifiant ta vie sociale.\n$@c{serious_mopen_fists}Plus rien n’a d’importance désormais, pas tant que j’aurai pas gagné.\n$@c{neutral_eclosed}J’ai atteint un stade où je ne peux plus perdre.\n@c{smile_eclosed}Je présume que ta philosophie était pas si fausse finalement.\n$@c{angry_mhalf}La défaite, c’est pour les faibles, et je ne suis plus un faible.\n$@c{serious_mopen_fists}Tiens-toi prête."
    },
    "victory": {
      "1": "@c{neutral}Que…@d{64} Qui es-tu ?"
    }
  },
  "rival_4_female": {
    "encounter": {
      "1": "@c{neutral}C’est moi ! Tu m’as pas encore oubliée… n’est-ce pas ?\n$@c{smile}Tu devrais être fier d’être arrivé aussi loin. GG !\nMais c’est certainement pas la fin de ton aventure.\n$@c{smile_eclosed}T’as éveillé en moi quelque chose que j’ignorais.\nTout mon temps passe dans l’entrainement.\n$@c{smile_ehalf}Je dors et je mange à peine, je m’entraine juste tous les jours, et deviens de plus en plus forte.\n$@c{neutral}En vrai, Je… J’ai de la peine à me reconnaitre.\n$Mais maintenant, je suis au top de mes capacités.\nJe doute que tu sois de nouveau capable de me battre.\n$Et tu sais quoi ? Tout ça, c’est de ta faute.\n@c{smile_ehalf}Et j’ignore si je dois te remercier ou te haïr.\n$@c{angry_mopen}Tiens-toi prêt."
    },
    "victory": {
      "1": "@c{neutral}Que…@d{64} Qui es-tu ?"
    },
    "defeat": {
      "1": "$@c{smile}Tu devrais être fier d’être arrivé jusque là."
    }
  },
  "rival_5": {
    "encounter": {
      "1": "@c{neutral}…"
    },
    "victory": {
      "1": "@c{neutral}…"
    }
  },
  "rival_5_female": {
    "encounter": {
      "1": "@c{neutral}…"
    },
    "victory": {
      "1": "@c{neutral}…"
    },
    "defeat": {
      "1": "$@c{smile_ehalf}…"
    }
  },
  "rival_6": {
    "encounter": {
      "1": "@c{smile_eclosed}Nous y revoilà.\n$@c{neutral}J’ai eu du temps pour réfléchir à tout ça.\nIl y a une raison à pourquoi tout semble étrange.\n$@c{neutral_eclosed}Ton rêve, ma volonté de te battre…\nFont partie de quelque chose de plus grand.\n$@c{serious}C’est même pas à propos de moi, ni de toi… Mais du monde, @c{serious_mhalf_fists}et te repousser dans tes limites est ma mission.\n$@c{neutral_eclosed}J’ignore si je serai capable de l’accomplir, mais je ferai tout ce qui est en mon pouvoir.\n$@c{neutral}Cet endroit est terrifiant… Et pourtant il m’a l’air familier, comme si j’y avais déjà mis les pieds.\n$@c{serious_mhalf_fists}Tu ressens la même chose, pas vrai ?\n$@c{serious}… et c’est comme si quelque chose ici me parlait.\n$Comme si c’était tout ce que ce monde avait toujours connu.\n$Ces précieux moments ensemble semblent si proches ne sont rien de plus qu’un lointain souvenir.\n$@c{neutral_eclosed}D’ailleurs, qui peut dire aujourd’hui qu’ils ont pu être réels ?\n$@c{serious_mopen_fists}Il faut que tu persévères. Si tu t’arrêtes, ça n’aura jamais de fin et t’es la seule à en être capable.\n$@c{serious_smile_fists}Difficile de comprendre le sens de tout ça, je sais juste que c’est la réalité.\n$@c{serious_mopen_fists}Si tu ne parviens pas à me battre ici et maintenant, tu n’as aucune chance."
    },
    "victory": {
      "1": "@c{smile_eclosed}J’ai fait ce que j’avais à faire.\n$Promets-moi juste une chose.\n@c{smile}Après avoir réparé ce monde… Rentre à la maison."
    }
  },
  "rival_6_female": {
    "encounter": {
      "1": "@c{smile_ehalf}C’est donc encore entre toi et moi.\n$@c{smile_eclosed}Tu sais, j’ai beau retouner ça dans tous les sens…\n$@c{smile_ehalf}Quelque chose peut expliquer tout ça, pourquoi tout semble si étrange…\n$@c{smile}T’as tes rêves, j’ai mes ambitions…\n$J’ai juste le sentiment qu’il y a un grand dessein derrière tout ça, derrière ce qu’on fait toi et moi.\n$@c{smile_eclosed}Je crois que mon but est de… repousser tes limites.\n$@c{smile_ehalf}Je suis pas certaine de bien être douée à cet exercice, mais je fais de mon mieux.\n$Cet endroit épouvantable cache quelque chose d’étrange… Tout semble si limpide…\n$Comme… si c’était tout ce que ce monde avait toujours connu.\n$@c{smile_eclosed}J’ai le sentiment que nos précieux moments ensemble sont devenus si flous.\n$@c{smile_ehalf}Ont-ils au moins été réels ? Tout semble si loin maintenant…\n$@c{angry_mopen}Il faut que tu persévères. Si tu t’arrêtes, ça n’aura jamais de fin et t’es le seul à en être capable.\n$@c{smile_ehalf}Je… j’ignore le sens de tout ça… Mais je sais que c’est la réalité.\n$@c{neutral}Si tu ne parviens pas à me battre ici et maintenant, tu n’as aucune chance."
    },
    "victory": {
      "1": "@c{smile_ehalf}Je… Je crois que j’ai rempli ma mission…\n$@c{smile_eclosed}Promets-moi… Après avoir réparé ce monde… Reviens à la maison sain et sauf.\n$@c{smile_ehalf}… Merci."
    }
  }
}
