import { SimpleTranslationEntries } from "#app/interfaces/locales";

export const tutorial: SimpleTranslationEntries = {
  intro: `PokéRogueへようこそ！ログライク要素が\n加わったバトル中心のポケモンファンゲームです。
  $このゲームは収益を上げず、Pokémonおよび使用される\n著作権資産に対する所有権を主張しません。
  $ゲームはまだ作業中ですが、完全にプレイすることができます。\nバグ報告はディスコードコミュニティをご利用ください。
  $ゲームが遅い場合は、ブラウザ設定で「ハードウェア\nアクセラレーション」がオンになっていることを確認してください`,

  accessMenu: "メニューにアクセスするには、入力待ちの間にMキーまたはEscを押してください。\nメニューには設定やさまざまな機能が含まれています。",

  menu: `このメニューから設定にアクセスできます。
  $設定ではゲームスピード、ウィンドウスタイル、\nおよびその他のオプションを変更できます。
  $ここにはさまざまな他の機能もありますので、\nぜひ確認してみてください！`,

  starterSelect: `この画面でZキーやSpaceを押してポケモンを選択できます。\n選んだポケモンは自分の最初のパーティーになります。
  $最大6匹のパーティーで始めることができますが\nポケモンによってポイントがあり、合計10を超えてはなりません。
  $捕まえたりふかさせたりすることで\n選択できる性別、特性、フォルムなどの幅を広げることができます。
  $個体値も徐々に累積して高くなるので、\n同じポケモンをたくさん捕まえてみてください！`,

  pokerus: `毎日ランダムでスターターの\n3種類に紫色の枠が表示されます。
  $登録されたスターターの中にあれば、\nパーティに追加してつよさを確認してみましょう！`,

  statChange: `ポケモンは交代しない限り、\n次のバトルでも能力変化が維持されます。
  $その代わりに、トレーナーバトルや新しいバイオームに\n入る直前に自動的にリセットされます。
  $CキーまたはShiftキーを押し続けると、\n現在のポケモンの能力変化を確認できます。
  $Vキーを押すと、\n相手が使用した技も確認できます。
  $ただし、今のバトルで相手ポケモンがすでに\n使った技のみが表示されます。`,

  selectItem: `バトルが終わるたびに、\nランダムなアイテム3つの中から1つを選んで獲得します。
  $種類は消耗品、ポケモンの持ち物、\n永続的なパッシブアイテムなど様々です。
  $ほとんどの消耗しない道具は\n効果が累積されます。
  $進化用など一部のアイテムは\n使用できる場合にのみ登場します。
  $持ち物を渡す機能を使用して\nポケモン同士で道具を持たせることもできます。
  $持ち物があれば、アイテム選択画面の\n右下に渡す機能が表示されます。
  $お金で消耗品を購入することもでき、\nウェーブが進むにつれて購入可能な種類が増えます。
  $アイテムを選択すると次のウェーブに進むため、\nまず消耗品の購入を行ってください。`,

  eggGacha: `この画面でポケモンのたまごクーポンを\nガチャができます。
  $卵は戦闘を繰り返すうちにふかします。\n珍しいほどもっと長くかかります。
  $ふかさせたポケモンはパーティーに追加されず、\nスターティングに登録されます。
  $卵からふかしたポケモンは一般的に\n野生で捕まえたポケモンよりも高い個体値を持ちます。
  $一部のポケモンは卵からしか手に入りません。
  $各ガチャマシンがそれぞれ異なるボーナスを持っているため、\n好きな方を使ってみてください!,`,
} as const;
