{
  "youngster": {
    "encounter": {
      "1": "Eai, quer batalhar?",
      "2": "Você também é um treinador novo?",
      "2_female": "Você também é uma treinadora nova?",
      "3": "Eai, nunca te vi antes. Vamos batalhar!",
      "4": "Acabei de perder, então estou tentando encontrar mais Pokémon.\nEspera! Você parece fraco! Vamos batalhar!",
      "4_female": "Acabei de perder, então estou tentando encontrar mais Pokémon.\nEspera! Você parece fraca! Vamos batalhar!",
      "5": "A gente já se conheceu antes? Não lembro muito bem. Enfim, prazer te conhecer!",
      "6": "Beleza! Vamos nessa!",
      "7": "Beleza! Lá vou eu! Vou te mostrar meu poder!",
      "8": "Hahaha... Vou te mostrar o quão incríveis são meus Pokémon!",
      "9": "Sem perder tempo com cumprimentos. Vamos logo, quando estiver pronto!",
      "9_female": "Sem perder tempo com cumprimentos. Vamos logo, quando estiver pronta!",
      "10": "Não baixe a guarda, ou você pode acabar chorando quando uma criança te vencer.",
      "11": "Eu criei meus Pokémon com muito cuidado. Você não tem permissão para machucá-los!",
      "12": "Que bom que você chegou! Não vai ser fácil daqui pra frente.",
      "13": "As batalhas continuam para sempre! Bem-vinda ao mundo sem fim!",
      "13_female": "As batalhas continuam para sempre! Bem-vindo ao mundo sem fim!"
    },
    "victory": {
      "1": "Uau! Você é forte!",
      "2": "Eu não tive chance, né?",
      "3": "Vou te encontrar de novo quando for mais velho e te vencer!",
      "4": "Ugh. Não tenho mais Pokémon.",
      "5": "Não acredito… NÃO ACREDITO! Como pude perder de novo…",
      "5_female": "Não acredito… NÃO ACREDITO! Como pude de novo…",
      "6": "Não! Eu perdi!",
      "7": "Uau! Você é incrível! Estou surpreso!",
      "8": "Pode ser… Como… Eu e meus Pokémon somos os mais fortes, porém…",
      "9": "Não vou perder da próxima vez! Vamos batalhar de novo algum dia!",
      "10": "Aff! Não vê que sou apenas uma criança? Não foi justo você ir com tudo!",
      "11": "Seus Pokémon são incríveis! Troca comigo!",
      "12": "Me empolguei um pouco antes, mas sobre qual trabalho eu estava falando?",
      "13": "Ahaha! É isso aí! Você já está em casa nesse mundo!"
    }
  },
  "lass": {
    "encounter": {
      "1": "Vamos batalhar, pode ser?",
      "2": "Você parece um treinador novo. Vamos batalhar!",
      "2_female": "Você parece uma treinadora nova. Vamos batalhar!",
      "3": "Não te reconheço. Que tal uma batalha?",
      "4": "Vamos ter uma batalha Pokémon divertida!",
      "5": "Vou te mostrar como realmente usar Pokémon!",
      "6": "Uma batalha séria começa com um começo sério! Tem certeza que está pronto?",
      "6_female": "Uma batalha séria começa com um começo sério! Tem certeza que está pronta?",
      "7": "Você só é jovem uma vez. E só tem uma chance em cada batalha. Logo, você será apenas uma memória.",
      "8": "Vai com calma comigo, tá? Mas vou lutar sério!",
      "9": "A escola é chata. Não tenho nada para fazer. Só estou batalhando para passar o tempo."
    },
    "victory": {
      "1": "Isso foi impressionante! Tenho muito a aprender.",
      "2": "Não pensei que você me venceria tão fácil…",
      "3": "Espero que possamos ter uma revanche um dia.",
      "4": "Isso foi incrivelmente divertido! Você me esgotou totalmente…",
      "5": "Você realmente me ensinou uma lição! Você é incrível!",
      "6": "Sério, eu perdi. Isso é, tipo, seriamente deprimente, mas você foi seriamente legal.",
      "7": "Não preciso de memórias como essa. Deletando memória…",
      "8": "Ei! Eu te disse para pegar leve comigo! Mesmo assim, você é legal quando fica sério.",
      "8_female": "Ei! Eu te disse para pegar leve comigo! Mesmo assim, você é legal quando fica séria.",
      "9": "Estou realmente cansando de batalhar… Deve haver algo novo para fazer…"
    }
  },
  "breeder": {
    "encounter": {
      "1": "Pokémon obedientes, Pokémon egoístas… Pokémon têm características únicas.",
      "2": "Embora minha criação e comportamento sejam ruins, criei meus Pokémon bem.",
      "3": "Hmm, você disciplina seus Pokémon? Mimar demais não é bom."
    },
    "victory": {
      "1": "É importante nutrir e treinar as características de cada Pokémon.",
      "2": "Ao contrário do meu lado diabólico, esses são bons Pokémon.",
      "3": "Muito elogio pode estragar tanto Pokémon quanto pessoas."
    },
    "defeat": {
      "1": "Você não deve ficar com raiva dos seus Pokémon, mesmo se perder uma batalha.",
      "2": "Certo? Pokémon bons, né? Eu sou adequado para criar coisas.",
      "3": "Não importa o quanto você ame seus Pokémon, ainda precisa discipliná-los quando se comportam mal."
    }
  },
  "breeder_female": {
    "encounter": {
      "1": "Pokémon nunca te traem. Eles retribuem todo o amor que você dá a eles.",
      "2": "Quer uma dica para treinar bons Pokémon?",
      "3": "Eu criei esses Pokémon muito especiais usando um método especial."
    },
    "victory": {
      "1": "Ugh… Não era para ser assim. Será que administrei a mistura errada?",
      "2": "Como isso aconteceu com meus Pokémon… O que você está dando de comer aos seus Pokémon?",
      "3": "Se eu perder, isso significa que eu estava só matando o tempo. Não machuca meu ego nem um pouco."
    },
    "defeat": {
      "1": "Isso prova que meus Pokémon aceitaram meu amor.",
      "2": "O verdadeiro truque para treinar bons Pokémon é capturar bons Pokémon.",
      "3": "Pokémon serão fortes ou fracos dependendo de como você os cria."
    }
  },
  "fisherman": {
    "encounter": {
      "1": "Anem! Você me fez perder uma fisgada!\nO que vai fazer sobre isso?",
      "2": "Sai daqui! Você está assustando os Pokémon!",
      "3": "Vamos ver se você consegue fisgar uma vitória!"
    },
    "victory": {
      "1": "Esqueça isso.",
      "2": "Da próxima vez, eu vou pescar a vitória!",
      "3": "Acho que subestimei a força das correntes dessa vez."
    }
  },
  "fisherman_female": {
    "encounter": {
      "1": "Uau! Peguei um grande!",
      "2": "Linha lançada, pronta para pescar o sucesso!",
      "3": "Pronta para fazer ondas!"
    },
    "victory": {
      "1": "Vou voltar com um anzol mais forte.",
      "2": "Vou pescar a vitória na próxima vez.",
      "3": "Estou só afiando meus anzóis para a revanche!"
    }
  },
  "swimmer": {
    "encounter": {
      "1": "Hora de mergulhar!",
      "2": "Vamos surfar nas ondas da vitória!",
      "3": "Pronto para fazer um splash!"
    },
    "victory": {
      "1": "Molhado na derrota!",
      "2": "Uma onda de derrota!",
      "3": "De volta à praia, eu acho."
    }
  },
  "backpacker": {
    "encounter": {
      "1": "Prepare-se, vamos começar!",
      "2": "Vamos ver se você consegue acompanhar!",
      "3": "Prepare-se, desafiante!",
      "4": "Passei 20 anos tentando me encontrar… Mas onde estou?"
    },
    "victory": {
      "1": "Dessa vez tropecei!",
      "2": "Ah, acho que estou perdido.",
      "3": "Caminho sem saída!",
      "4": "Espere um segundo! Ei! Você não sabe quem eu sou?"
    }
  },
  "ace_trainer": {
    "encounter": {
      "1": "Você parece bastante confiante.",
      "2": "Seus Pokémon… Mostre-os para mim…",
      "3": "Como sou um Treinador Ás, as pessoas acham que sou forte.",
      "4": "Você sabe o que é preciso para ser um Treinador Ás?"
    },
    "victory": {
      "1": "Sim… Você tem bons Pokémon…",
      "2": "O quê?! Mas sou um gênio das batalhas!",
      "3": "Claro, você é o personagem principal!",
      "3_female": "Claro, você é a personagem principal!",
      "4": "OK! OK! Você poderia ser um Treinador Ás!",
      "4_female": "OK! OK! Você poderia ser uma Treinador Ás!"
    },
    "defeat": {
      "1": "Estou dedicando corpo e alma às batalhas de Pokémon!",
      "2": "Tudo dentro das minhas expectativas… Nada para se surpreender…",
      "3": "Eu achava que cresceria para ser uma pessoa frágil que parecia que quebraria se você apertasse muito.",
      "4": "Claro que sou forte e não perco. É importante ganhar com graça."
    }
  },
  "parasol_lady": {
    "encounter": {
      "1": "Hora de embelezar o campo de batalha com elegância e postura!"
    },
    "victory": {
      "1": "Minha elegância permanece inabalável!"
    }
  },
  "twins": {
    "encounter": {
      "1": "Prepare-se, porque quando nos unimos, é o dobro do problema!",
      "2": "Dois corações, uma estratégia – vamos ver se você consegue acompanhar nosso poder de gêmeos!",
      "3": "Espero que esteja pronto para o dobro do problema, porque estamos prestes a causar!",
      "3_female": "Espero que esteja pronta para o dobro do problema, porque estamos prestes a causar!"
    },
    "victory": {
      "1": "Podemos ter perdido essa rodada, mas nosso vínculo permanece inquebrável!",
      "2": "Nosso espírito de gêmeos não será apagado por muito tempo.",
      "3": "Voltaremos mais fortes como uma dupla dinâmica!"
    },
    "defeat": {
      "1": "O poder dos gêmeos reina supremo!",
      "2": "Dois corações, um triunfo!",
      "3": "Dobro de sorrisos, dobro da dança da vitória!"
    }
  },
  "cyclist": {
    "encounter": {
      "1": "Prepare-se para comer poeira!",
      "2": "Prepare-se, desafiante! Estou prestes a te deixar para trás!",
      "3": "Pé no pedal, vamos ver se você consegue acompanhar!"
    },
    "victory": {
      "1": "As rodas podem estar paradas, mas a determinação continua a pedalar.",
      "2": "Fui mais rápido!",
      "3": "O caminho para a vitória tem muitas curvas e voltas para explorar."
    }
  },
  "black_belt": {
    "encounter": {
      "1": "Elogio sua coragem ao me desafiar! Pois eu sou o que tem o chute mais forte!",
      "2": "Oh, entendo. Você gostaria de ser cortado em pedaços? Ou prefere o papel de saco de pancadas?",
      "2_female": "Oh, entendo. Você gostaria de ser cortada em pedaços? Ou prefere o papel de saco de pancadas?"
    },
    "victory": {
      "1": "Oh. Os Pokémon fizeram a luta. Meu chute forte não ajudou em nada.",
      "2": "Hmmm… Se eu ia perder de qualquer maneira, esperava ficar totalmente destruído no processo."
    }
  },
  "battle_girl": {
    "encounter": {
      "1": "Você não precisa tentar me impressionar. Você pode perder contra mim."
    },
    "victory": {
      "1": "É difícil dizer adeus, mas estamos ficando sem tempo…"
    }
  },
  "hiker": {
    "encounter": {
      "1": "Minha barriga de meia-idade me deu tanta gravidade quanto as montanhas que eu escalo!",
      "2": "Herdei esse corpo ossudo dos meus pais… Sou como uma cadeia de montanhas viva…"
    },
    "victory": {
      "1": "Pelo menos não posso perder quando se trata de IMC!",
      "2": "Não é suficiente… Nunca é suficiente. Meu colesterol ruim não está alto o suficiente…"
    }
  },
  "ranger": {
    "encounter": {
      "1": "Quando estou cercado pela natureza, a maioria das outras coisas deixa de importar.",
      "2": "Quando estou vivendo sem natureza na minha vida, às vezes sinto uma crise de ansiedade se aproximando."
    },
    "victory": {
      "1": "Não importa para a vastidão da natureza se eu ganhar ou perder…",
      "2": "Algo assim é bastante trivial comparado aos sentimentos sufocantes da vida na cidade."
    },
    "defeat": {
      "1": "Ganhei a batalha. Mas a vitória não é nada comparada à vastidão da natureza…",
      "2": "Tenho certeza de que como você se sente não é tão ruim se comparar aos meus ataques de ansiedade…"
    }
  },
  "scientist": {
    "encounter": {
      "1": "Minha pesquisa levará este mundo à paz e alegria."
    },
    "victory": {
      "1": "Sou um gênio… Não devo perder para alguém como você…"
    }
  },
  "school_kid": {
    "encounter": {
      "1": "Heehee. Estou confiante nos meus cálculos e análises.",
      "2": "Estou ganhando o máximo de experiência que posso porque quero ser um Líder de Ginásio um dia."
    },
    "victory": {
      "1": "Aff… Cálculo e análise talvez não sejam páreo para o acaso…",
      "2": "Até experiências difíceis e desafiadoras têm seu propósito, eu acho."
    }
  },
  "artist": {
    "encounter": {
      "1": "Eu costumava ser popular, mas agora estou acabado."
    },
    "victory": {
      "1": "À medida que os tempos mudam, os valores também mudam. Percebi isso tarde demais."
    }
  },
  "guitarist": {
    "encounter": {
      "1": "Prepare-se para sentir o ritmo da derrota enquanto eu toco minha vitória!"
    },
    "victory": {
      "1": "Silenciado por agora, mas minha melodia de resiliência continuará a tocar."
    }
  },
  "worker": {
    "encounter": {
      "1": "Me incomoda que as pessoas sempre me entendam mal. Sou muito mais puro do que todos pensam."
    },
    "victory": {
      "1": "Eu realmente não quero que minha pele queime, então quero ficar na sombra enquanto trabalho."
    }
  },
  "worker_female": {
    "encounter": {
      "1": "Me incomoda que as pessoas sempre me entendam mal.\n$Sou muito mais pura do que todos pensam."
    },
    "victory": {
      "1": "Eu realmente não quero que minha pele queime, então quero ficar na sombra enquanto trabalho."
    },
    "defeat": {
      "1": "Meu corpo e mente nem sempre estão necessariamente em sincronia."
    }
  },
  "worker_double": {
    "encounter": {
      "1": "Vou te mostrar que podemos te quebrar. Estamos treinando no campo!"
    },
    "victory": {
      "1": "Que estranho… Como isso pode ser… Não deveria ter sido superado."
    }
  },
  "hex_maniac": {
    "encounter": {
      "1": "Normalmente, só escuto música clássica, mas se eu perder, acho que vou tentar um pouco de new age!",
      "2": "Eu fico mais forte a cada lágrima que derramo."
    },
    "victory": {
      "1": "É o início da era de Aquário?",
      "2": "Agora posso ficar ainda mais forte. Cresço com cada rancor."
    },
    "defeat": {
      "1": "New age se refere simplesmente aos compositores clássicos do século XX, certo?",
      "2": "Não fique preso na tristeza ou frustração. Você pode usar seus rancores para se motivar.",
      "2_female": "Não fique presa na tristeza ou frustração. Você pode usar seus rancores para se motivar."
    }
  },
  "psychic": {
    "encounter": {
      "1": "Oi! Concentre-se!"
    },
    "victory": {
      "1": "Perdi minha concentração!"
    }
  },
  "officer": {
    "encounter": {
      "1": "Prepare-se, porque a justiça está prestes a ser servida!",
      "2": "Pronto para defender a lei e servir a justiça no campo de batalha!"
    },
    "victory": {
      "1": "O peso da justiça parece mais pesado do que nunca…",
      "2": "As sombras da derrota pairam no distrito."
    }
  },
  "beauty": {
    "encounter": {
      "1": "Minha última batalha… É assim que eu gostaria que víssemos esta partida…"
    },
    "victory": {
      "1": "Foi divertido… Vamos ter outra última batalha algum dia…"
    }
  },
  "baker": {
    "encounter": {
      "1": "Espero que esteja pronto para saborear a derrota!",
      "1_female": "Espero que esteja pronta para saborear a derrota!"
    },
    "victory": {
      "1": "Vou assar uma revanche."
    }
  },
  "biker": {
    "encounter": {
      "1": "Hora de acelerar e te deixar na poeira!"
    },
    "victory": {
      "1": "Vou me ajustar para a próxima corrida."
    }
  },
  "firebreather": {
    "encounter": {
      "1": "Minhas chamas irão te consumir!",
      "2": "Minha alma está pegando fogo. Irei te mostrar como queima!",
      "3": "Cola aqui e dá uma olhada!"
    },
    "victory": {
      "1": "Fui reduzido a cinzas…",
      "2": "Uau! Isso foi quente!",
      "3": "Ai! Queimei minha língua!"
    }
  },
  "sailor": {
    "encounter": {
      "1": "Mano, você vai andar na prancha se perder!",
      "2": "Vem com tudo! Sou um marinheiro com orgulho!",
      "3": "Ahoy marujo! Tá enjoado, é?!",
      "3_female": "Ahoy maruja! Tá enjoada, é?!"
    },
    "victory": {
      "1": "Argh! Perdi pra uma criança!",
      "2": "Sua vontade de ganhar me afogou!",
      "3": "Estou achando que quem tá enjoado sou eu..."
    }
  },
  "archer": {
    "encounter": {
      "1": "Antes de você ir mais longe, vamos ver como você se sai contra nós, Equipe Rocket!",
      "2": "Eu tenho recebido relatórios de que suas habilidades não são insignificantes. Vamos ver se são verdadeiros.",
      "3": "Eu sou Archer, um Admin da Equipe Rocket. E não tenho piedade dos inimigos da nossa organização."
    },
    "victory": {
      "1": "Que vexame!",
      "2": "Com minhas habilidades atuais, eu não estava à altura da tarefa, afinal.",
      "3": "M-me perdoe, Giovanni... Por ser derrotado por um mero treinador..."
    }
  },
  "ariana": {
    "encounter": {
      "1": "Pera aí! Não podemos deixar alguém solto por aí. Isso é prejudicial para o orgulho da Equipe Rocket, entende?",
      "2": "Eu não sei ou me importo se o que estou fazendo é certo ou errado... Eu apenas coloco minha fé em Giovanni e faço o que me é dito.",
      "3": "Sua viagem termina aqui. Vou te derrubar!"
    },
    "victory": {
      "1": "Uau, você é forte. Que desperdício. Se você se juntasse à Equipe Rocket, poderia se tornar um Executivo.",
      "1_female": "Uau, você é forte. Que desperdício. Se você se juntasse à Equipe Rocket, poderia se tornar uma Executiva.",
      "2": "Eu... Eu estou arrasada...",
      "3": "Aaaieeeee! Isso não pode estar acontecendo! Eu lutei muito, mas ainda perdi…"
    }
  },
  "proton": {
    "encounter": {
      "1": "O que você quer? Se você interromper nosso trabalho, não espere misericórdia!",
      "2": "O que temos aqui? Costumam me chamar de o cara mais assustador e cruel da Equipe Rocket… Eu recomendo fortemente que você não interfira nos nossos negócios!",
      "3": "Eu sou Proton, um Admin da Equipe Rocket. Estou aqui para acabar com a sua intromissão!"
    },
    "victory": {
      "1": "A fortaleza caiu!",
      "2": "Você pode ter vencido desta vez… Mas tudo o que fez foi aumentar a ira da Equipe Rocket…",
      "3": "Fui derrotado… Mas não esquecerei disso!"
    }
  },
  "petrel": {
    "encounter": {
      "1": "Muhahaha, estávamos esperando por você. Eu? Você não sabe quem eu sou? Sou eu, Giovanni. O majestoso Giovanni em pessoa! Wahahaha! ...Huh? Eu não pareço nada com Giovanni? Eu nem mesmo pareço com Giovanni? Como assim? Trabalhei tanto para imitá-lo!",
      "2": "Eu sou Petrel, um Admin da Equipe Rocket. Não permitirei que você interfira em nossos planos!",
      "3": "O Executivo da Rocket, Petrel, vai lidar com este intruso!"
    },
    "victory": {
      "1": "OK, OK. Vou te contar onde ele está.",
      "2": "Eu... Eu não consegui fazer nada... Giovanni, por favor, me perdoe...",
      "3": "Não, eu não posso deixar isso me afetar. Tenho que informar os outros…"
    }
  },
  "tabitha": {
    "encounter": {
      "1": "Hehehe! Então você veio até aqui! Mas você chegou tarde demais!",
      "2": "Hehehe... Já chegou aqui, não é? Nós subestimamos você! Mas é isso! Eu sou um passo acima dos Capangas que você viu até agora. Não estou ganhando tempo. Vou te pulverizar!",
      "3": "Vou te dar um gostinho da dor! Resigne-se a isso!"
    },
    "victory": {
      "1": "Hehehe! Você pode ter me derrotado, mas não tem chance contra o Chefe! Se você se perder agora, não terá que enfrentar uma surra sonora!",
      "2": "Hehehe... Então, eu também perdi...",
      "3": "Ahya! Como isso pode ser? Para um Admin como eu perder para um treinador qualquer...",
      "3_female": "Ahya! Como isso pode ser? Para um Admin como eu perder para uma treinadora qualquer..."
    }
  },
  "courtney": {
    "encounter": {
      "1": "A coisa... A coisa que você segura... É o que... É o que nós da Equipe Magma procuramos...",
      "2": "... Bem então... Deletando...",
      "3": "...Ha. ...Analisando... ...Hah♪"
    },
    "victory": {
      "1": "... ...Mudar...o mundo.",
      "2": "Como antecipado. Não antecipado. Você. Bloqueio de alvo... concluído. Iniciando... experimento. Você. Para sempre. Aha... ♪",
      "3": "... De novo? Isso não foi antecipado. ...Eu sabia. Você... é interessante! ...Haha. ♪"
    }
  },
  "shelly": {
    "encounter": {
      "1": "Ahahahaha! Você vai se meter nos assuntos da Equipe Aqua? Você é absolutamente destemido, simplesmente ignorante ou ambos! Você é tão fofo que chega a ser nojento! Vou te derrubar",
      "1_female": "Ahahahaha! Você vai se meter nos assuntos da Equipe Aqua? Você é absolutamente destemida, simplesmente ignorante ou ambos! Você é tão fofa que chega a ser nojenta! Vou te derrubar",
      "2": "O que é isso? Quem é essa criança mimada?",
      "3": "Relaxe. Seja paciente. Vou te esmagar em breve."
    },
    "victory": {
      "1": "Ahahahaha! Fomos surpreendidos inesperadamente! Estamos sem opções. Teremos que recuar. Mas esta não é a última vez que você verá a Equipe Aqua! Temos outros planos! Não se esqueça disso!",
      "2": "Ahhh?! Fui muito fácil com você?!",
      "3": "Uh. Você está me dizendo que melhorou seu jogo ainda mais durante a luta? Você é um pirralho com um futuro brilhante… Meu Pokémon e eu não temos mais forças para lutar… Vá em frente… Vá e seja destruído por Archie.",
      "3_female": "Uh. Você está me dizendo que melhorou seu jogo ainda mais durante a luta? Você é uma pirralha com um futuro brilhante… Meu Pokémon e eu não temos mais forças para lutar… Vá em frente… Vá e seja destruída por Archie."
    }
  },
  "matt": {
    "encounter": {
      "1": "Hoohahaha! O que, você tem um parafuso solto ou algo assim? Olhe para você, pequena pessoa Makuhita!",
      "2": "Oho! Você! Você é aquela criança engraçada!",
      "3": "O que você está fazendo aqui? Você nos seguiu?"
    },
    "victory": {
      "1": "Muito bem, até que o Chefe tenha tempo para você, serei seu oponente!",
      "2": "Posso sentir! Posso sentir, tudo bem! A força saindo de você! Mais! Eu ainda quero mais! Mas parece que estamos sem tempo...",
      "3": "Isso foi divertido! Eu sabia que você me mostraria um bom tempo! Estou ansioso para enfrentá-lo novamente algum dia!",
      "3_female": "Isso foi divertido! Eu sabia que você me mostraria um bom tempo! Estou ansioso para enfrentá-la novamente algum dia!"
    }
  },
  "mars": {
    "encounter": {
      "1": "Sou Mars, uma das principais Comandantes da Equipe Galáctica.",
      "2": "A visão da Equipe Galáctica para o futuro é inabalável. A oposição será esmagada sem piedade!",
      "3": "Sentindo-se nervoso? Você deveria estar!",
      "3_female": "Sentindo-se nervosa? Você deveria estar!"
    },
    "victory": {
      "1": "Isso não pode estar acontecendo! Como eu perdi?!",
      "2": "Você tem alguma habilidade, eu admito isso.",
      "3": "Derrotada... Este foi um erro caro."
    }
  },
  "jupiter": {
    "encounter": {
      "1": "Júpiter, Comandante da Equipe Galáctica, ao seu serviço.",
      "2": "A resistência é inútil. A Equipe Galáctica prevalecerá!",
      "3": "Você está tremendo... já está com medo?"
    },
    "victory": {
      "1": "De jeito nenhum... Eu perdi?!",
      "2": "Impressionante, você tem coragem!",
      "3": "Perder assim... Que embaraço."
    }
  },
  "saturn": {
    "encounter": {
      "1": "Eu sou Saturno, Comandante da Equipe Galáctica.",
      "2": "Nossa missão é absoluta. Qualquer obstáculo será obliterado!",
      "3": "É medo o que vejo em seus olhos?"
    },
    "victory": {
      "1": "Impossível... Derrotado por você?!",
      "2": "Você provou ser um adversário digno.",
      "3": "Derrotado... Isso é inaceitável."
    }
  },
  "zinzolin": {
    "encounter": {
      "1": "Você poderia se tornar uma ameaça para a Equipe Plasma, então vamos eliminá-lo aqui e agora!",
      "1_female": "Você poderia se tornar uma ameaça para a Equipe Plasma, então vamos eliminá-la aqui e agora!",
      "2": "Oh, pelo amor de Deus... Eu não esperava ter que lutar neste frio congelante!",
      "3": "Você é um treinador impressionante para ter chegado tão longe. Mas termina aqui.",
      "3_female": "Você é uma treinadora impressionante para ter chegado tão longe. Mas termina aqui."
    },
    "victory": {
      "1": "Ghetsis... Eu falhei com você...",
      "2": "Está amargamente frio. Estou tremendo. Estou sofrendo. Ainda assim, estou vitorioso.",
      "3": "Hmph. Você é um treinador mais esperto do que eu esperava, mas não esperto o suficiente.",
      "3_female": "Hmph. Você é uma treinadora mais esperta do que eu esperava, mas não esperta o suficiente."
    }
  },
  "rood": {
    "encounter": {
      "1": "Você é uma ameaça para a Equipe Plasma. Não podemos deixá-lo ir embora daqui e agora!",
      "1_female": "Você é uma ameaça para a Equipe Plasma. Não podemos deixá-la ir embora daqui e agora!",
      "2": "Oh, este vento gelado... Eu nunca pensei que teria que lutar aqui!",
      "3": "Você é um treinador notável para ter chegado tão longe. Mas é aqui que termina.",
      "3_female": "Você é uma treinadora notável para ter chegado tão longe. Mas é aqui que termina."
    },
    "victory": {
      "1": "Ghetsis... Eu falhei em minha missão...",
      "2": "O frio é penetrante. Estou tremendo. Estou sofrendo. Ainda assim, triunfei.",
      "3": "Hm. Você é um treinador talentoso, mas infelizmente não talentoso o suficiente.",
      "3_female": "Hm. Você é uma treinadora talentosa, mas infelizmente não talentosa o suficiente."
    }
  },
  "xerosic": {
    "encounter": {
      "1": "Ah ha ha! Será um prazer. Vamos lá, pequeno treinador! Vamos ver o que você tem!",
      "1_female": "Ah ha ha! Será um prazer. Vamos lá, pequena treinadora! Vamos ver o que você tem!",
      "2": "Hmm... Você é mais poderoso do que parece. Eu me pergunto quanta energia há dentro de você.",
      "2_female": "Hmm... Você é mais poderosa do que parece. Eu me pergunto quanta energia há dentro de você.",
      "3": "Eu estava esperando por você! Preciso fazer uma pequena pesquisa sobre você! Vamos começar!"
    },
    "victory": {
      "1": "Ah, você é bastante forte. Oh sim—muito forte, de fato.",
      "2": "Ding-ding-ding! Você conseguiu! Ao vencedor, os despojos!",
      "2_female": "Ding-ding-ding! Você conseguiu! À vencedora, os despojos!",
      "3": "Maravilhoso! Incrível! Você tem uma tremenda habilidade e coragem!"
    }
  },
  "bryony": {
    "encounter": {
      "1": "Eu sou Bryony, e será um prazer lutar com você. Mostre-me o que você tem.",
      "2": "Impressionante... Você é mais poderoso do que parece. Vamos ver a verdadeira extensão de sua energia.",
      "2_female": "Impressionante... Você é mais poderosa do que parece. Vamos ver a verdadeira extensão de sua energia.",
      "3": "Eu antecipei sua chegada. É hora de um pequeno teste. Vamos começar?"
    },
    "victory": {
      "1": "Você é bastante forte. Oh sim—muito forte, de fato.",
      "2": "Ding-ding-ding! Você se saiu bem. A vitória é sua.",
      "3": "Maravilhoso! Notável! Sua habilidade e coragem são admiráveis."
    }
  },
  "rocket_grunt": {
    "encounter": {
      "1": "Se prepara pra encrenca!",
      "2": "Estamos realizando um grande trabalho aqui! Cai fora, moleque!",
      "2_female": "Estamos realizando um grande trabalho aqui! Cai fora, garota!",
      "3": "Entregue seus Pokémon ou enfrente a ira da Equipe Rocket!",
      "4": "Você está prestes a experimentar o verdadeiro terror da Equipe Rocket!",
      "5": "Ei, moleque! Eu sou um tipo de cara da Equipe Rocket!",
      "5_female": "Ei, garota! Eu sou um tipo de cara da Equipe Rocket!"
    },
    "victory": {
      "1": "Equipe Rocket decolando de novo!",
      "2": "Oh não! Eu deixei a Chave de Elevação cair!",
      "3": "Eu estraguei tudo!",
      "4": "Meus associados não vão tolerar isso!",
      "5": "Você diz o que? Equipe Rocket tchau-tchau a vai-vai? Quebrado é diz você?"
    }
  },
  "magma_grunt": {
    "encounter": {
      "1": "Se você se meter com a Equipe Magma, não teremos piedade!",
      "2": "É melhor você não interferir em nossos planos! Estamos tornando o mundo um lugar melhor!",
      "3": "Você está no caminho! A Equipe Magma não tem tempo para crianças como você!",
      "4": "Espero que você tenha trazido marshmallows porque as coisas estão prestes a esquentar!",
      "5": "Vamos usar o poder de um vulcão! Vai ser... explosivo! Entendeu? Heh heh!"
    },
    "victory": {
      "1": "Ahn? Eu perdi?!",
      "2": "Não posso acreditar que perdi! Até pulei o almoço por isso.",
      "3": "De jeito nenhum! Você é apenas uma criança!",
      "4": "Urrrgh... Eu deveria ter me escondido em nosso esconderijo imediatamente...",
      "5": "Você me venceu... Você acha que o chefe vai cortar meu salário por isso?"
    }
  },
  "aqua_grunt": {
    "encounter": {
      "1": "Não pegamos leve com quem se mete com a Equipe Aqua, nem mesmo crianças!",
      "2": "Grrr... Você tem coragem de se intrometer com a Equipe Aqua!",
      "3": "Você está prestes a se molhar! E não apenas por causa dos meus Pokémon aquáticos!",
      "4": "Nós, da Equipe Aqua, existimos para o bem de todos!",
      "5": "Prepare-se para ser levado pelas ondas do meu... uh, Pokémon! Sim, meu Pokémon!"
    },
    "victory": {
      "1": "Tá de brincadeira!",
      "2": "Arrgh, eu não contei que seria atrapalhado por uma criança intrometida!",
      "3": "Eu perdi?! Acho que vou ter que nadar de volta para o esconderijo agora...",
      "4": "Oh, cara, que desastre... O chefe vai ficar furioso...",
      "5": "Você me venceu... Você acha que o chefe vai me fazer andar na prancha por isso?"
    }
  },
  "galactic_grunt": {
    "encounter": {
      "1": "Não mexa com a Equipe Galáctica!",
      "2": "Presencie o poder da nossa tecnologia e o futuro que vislumbramos!",
      "3": "Em nome da Equipe Galáctica, eliminarei qualquer um que ficar em nosso caminho!",
      "4": "Prepare-se para perder!",
      "5": "Espero que você esteja pronto para uma surra cósmica!",
      "5_female": "Espero que você esteja pronta para uma surra cósmica!"
    },
    "victory": {
      "1": "Fui amassado...",
      "2": "Este contratempo não significa nada no grande esquema.",
      "3": "Nossos planos são maiores que esta derrota.",
      "4": "Como?!",
      "5": "Nota para mim mesmo: praticar batalhas Pokémon, o mais rápido possível."
    }
  },
  "plasma_grunt": {
    "encounter": {
      "1": "Não toleramos pessoas que pensam diferente de nós!",
      "2": "Se eu ganhar de você, liberte seus Pokémon!",
      "3": "Se você atrapalhar a Equipe Plasma, eu cuidarei de você!",
      "4": "A Equipe Plasma vai libertar os Pokémon de humanos egoístas como você!",
      "5": "Nossos penteados são de outro mundo... mas nossas habilidades de batalha? Você descobrirá em breve."
    },
    "victory": {
      "1": "Plasmaaaaaaaaa!",
      "2": "Como eu pude perder...",
      "3": "...Que Pokémon fraco, vou ter que roubar alguns melhores!",
      "4": "Grandes planos são sempre interrompidos.",
      "5": "Isso é ruim... Ruim ruim ruim ruim ruim ruim ruim! Ruim para a Equipe Plasma! Ou Plasruim, para abreviar!"
    }
  },
  "flare_grunt": {
    "encounter": {
      "1": "Seus Pokémon não são páreo para a elegância da Equipe Flare.",
      "2": "Espero que você tenha trazido seus óculos de sol, porque as coisas vão ficar brilhantes!",
      "3": "A Equipe Flare vai purificar o mundo da imperfeição!",
      "4": "Prepare-se para enfrentar o brilho da Equipe Flare!",
      "5": "A moda é o mais importante para nós!"
    },
    "victory": {
      "1": "O futuro não parece brilhante para mim.",
      "2": "Talvez haja mais na batalha do que eu pensei. De volta à prancheta.",
      "3": "Gahh?! Eu perdi?!",
      "4": "Mesmo na derrota, a elegância da Equipe Flare brilha.",
      "5": "Você pode ter me vencido, mas quando eu perco, eu saio com estilo!"
    }
  },
  "aether_grunt": {
    "encounter": {
      "1": "Eu vou lutar com tudo o que tenho para te eliminar!",
      "2": "Eu não me importo se você é uma criança ou o que. Eu vou te mandar voando se você nos ameaçar!",
      "3": "Me mandaram afastar Treinadores, não importa quem sejam!",
      "4": "Eu vou te mostrar o poder do Paraíso Aether!",
      "5": "Agora que você descobriu a escuridão no coração do Paraíso Aether, precisamos que você desapareça convenientemente!"
    },
    "victory": {
      "1": "Aff! Você parece ter muita habilidade.",
      "2": "O que isso significa? O que isso significa!",
      "3": "Ei! Você é tão forte que não há como eu te afastar!",
      "4": "Hmm... Parece que eu posso ter perdido.",
      "5": "Aqui está uma resposta para você: Aiyee!"
    }
  },
  "faba": {
    "encounter": {
      "1": "Eu, o Chefe de Ramo Faba, vou te mostrar a dureza do mundo real!",
      "2": "O homem chamado de última linha de defesa do Paraíso Aether vai batalhar com uma mera criança?",
      "3": "Eu, Faba, sou o Chefe de Ramo do Paraíso Aether. O único no mundo, eu sou insubstituível."
    },
    "victory": {
      "1": "Aiyee!",
      "2": "C-c-como assim?! Como uma criança...",
      "3": "Isso é por que... Isso é por que eu não consigo gostar de crianças."
    }
  },
  "skull_grunt": {
    "encounter": {
      "1": "Nós não somos maus, somos apenas durões!",
      "2": "Quer um pouco de nós? É assim que dizemos olá! Prazer em conhecê-los, otários!",
      "3": "Somos só um bando de caras e minas com um grande interesse nos Pokémon dos outros!",
      "4": "Por que você está tentando agir durão quando já somos durões como ossos aqui fora, mano?",
      "5": "Equipe Skull na área! Não podemos pagar o aluguel! Nos divertimos muito, mas nossa juventude foi desperdiçada!"
    },
    "victory": {
      "1": "Ahn? Já acabou?",
      "2": "Hora de dar o fora, mano! Vamos ter que dizer tchau, mano!",
      "3": "Nem precisamos dos seus Pokémon fracotes mesmo!",
      "4": "Que?! Esse muleque é muito forte! Não tem como negar!",
      "5": "Então, o que? Eu sou pior que um Pokémon?! Eu já tenho problemas de autoestima, cara."
    }
  },
  "plumeria": {
    "encounter": {
      "1": " ...Hmph. Você não parece nada especial para mim.",
      "2": "Esses Capangas gastam muito tempo tentando lidar com crianças como você...",
      "3": "Mexe com qualquer um da Equipe Skull, e eu vou te mostrar o quão séria eu posso ficar."
    },
    "victory": {
      "1": "Aff! Você é bem forte. Tenho que admitir.",
      "2": "Aff! Você é bem forte. Agora eu entendi por que meus Capangas gastam tanto tempo batalhando com crianças.",
      "3": "Aff! Acho que eu só tenho que aceitar essa derrota."
    }
  },
  "macro_grunt": {
    "encounter": {
      "1": "Parece que aqui é o fim da linha para você!",
      "2": "Você é um treinador, não é? Temo que isso não lhe dê o direito de interferir em nosso trabalho.",
      "3": "Sou da Macro Cosmos Seguros! Já tem um seguro de vida?"
    },
    "victory": {
      "1": "Eu não tenho muita escolha a não ser recuar respeitosamente.",
      "2": "Ter que desistir do meu dinheiro... Perder significa que estou de volta no vermelho...",
      "3": "Ninguém pode vencer a Macro Cosmos quando se trata de nossa dedicação ao trabalho!"
    }
  },
  "oleana": {
    "encounter": {
      "1": "Eu não vou deixar ninguém interferir no plano do Sr. Rose!",
      "2": "Então, você passou por todo o pessoal especial que eu ordenei para te parar. Eu não esperaria nada menos.",
      "3": "Pelo presidente! Eu não vou perder!"
    },
    "victory": {
      "1": "*suspiro* Eu não consegui vencer... Oleana... você realmente é uma mulher sem esperança.",
      "2": "Aff! Isso é inaceitável... O que eu estava pensando... Qualquer treinador que chega tão longe não seria um fracote...",
      "3": "*suspiro* Eu sou uma Oleana cansada..."
    }
  },
  "rocket_boss_giovanni_1": {
    "encounter": {
      "1": "Tenho que admitir, estou impressionado que tenha chegado até aqui!"
    },
    "victory": {
      "1": "QUÊ! Isso não é possível!"
    },
    "defeat": {
      "1": "Guarde minhas palavras.\nNão ser capaz de medir sua própria força mostra que você ainda é uma criança."
    }
  },
  "rocket_boss_giovanni_2": {
    "encounter": {
      "1": "Meus antigos associados precisam de mim... Você vai ficar no meu caminho?"
    },
    "victory": {
      "1": "Como isso é possível...?\nO precioso sonho da Equipe Rocket se tornou pouco mais que uma ilusão..."
    },
    "defeat": {
      "1": "A Equipe Rocket renascerá, e eu dominarei o mundo!"
    }
  },
  "magma_boss_maxie_1": {
    "encounter": {
      "1": "Eu vou te enterrar com minhas próprias mãos.\nEspero que você aprecie essa honra!"
    },
    "victory": {
      "1": "Ugh! Você é... bastante capaz...\nEu fiquei para trás, mas apenas por um triz..."
    },
    "defeat": {
      "1": "A Equipe Magma vai prevalecer!"
    }
  },
  "magma_boss_maxie_2": {
    "encounter": {
      "1": "Você é o último obstáculo entre mim e meus objetivos.\nPrepare-se para meu ataque final! Fuhahaha!"
    },
    "victory": {
      "1": "Isso... Isso não é... Ngh..."
    },
    "defeat": {
      "1": "E agora... Eu transformarei este planeta em uma terra ideal para a humanidade."
    }
  },
  "aqua_boss_archie_1": {
    "encounter": {
      "1": "Eu sou o líder da Equipe Aqua, então temo que esse seja o fim da linha para você."
    },
    "victory": {
      "1": "Vamos nos encontrar de novo em algum lugar. Eu vou ter certeza de lembrar desse rosto."
    },
    "defeat": {
      "1": "Brilhante! Nada vai parar minha equipe agora!"
    }
  },
  "aqua_boss_archie_2": {
    "encounter": {
      "1": "Estive esperando tanto tempo por este dia.\nEste é o verdadeiro poder da minha equipe!"
    },
    "victory": {
      "1": "Como eu suspeitava..."
    },
    "defeat": {
      "1": "Eu vou voltar tudo neste mundo ao seu estado puro e original!!"
    }
  },
  "galactic_boss_cyrus_1": {
    "encounter": {
      "1": "Você foi compelido a vir aqui por tal sentimentalismo vazio\nEu farei você se arrepender de ter ouvido seu coração!",
      "1_female": "Você foi compelida a vir aqui por tal sentimentalismo vazio\nEu farei você se arrepender de ter ouvido seu coração!"
    },
    "victory": {
      "1": "Interessante. E bastante curioso."
    },
    "defeat": {
      "1": "Eu criarei meu novo mundo..."
    }
  },
  "galactic_boss_cyrus_2": {
    "encounter": {
      "1": "Nos encontramos novamente. Parece que nossos destinos estão entrelaçados.\nMas aqui e agora, eu finalmente quebrarei esse vínculo!"
    },
    "victory": {
      "1": "Como? Como? COMO?!"
    },
    "defeat": {
      "1": "Até logo."
    }
  },
  "plasma_boss_ghetsis_1": {
    "encounter": {
      "1": "Ninguém pode me deter! Não importa quem seja ou o que faça!"
    },
    "victory": {
      "1": "Como isso é possível? Eu sou o criador da Equipe Plasma! Eu sou perfeito!"
    },
    "defeat": {
      "1": "Eu sou o governante perfeito de um novo mundo perfeito! Mwa ha ha!"
    }
  },
  "plasma_boss_ghetsis_2": {
    "encounter": {
      "1": "Vamos! Eu quero ver sua cara depois que você perder toda a esperança!"
    },
    "victory": {
      "1": "Meus cálculos... Não! Meus planos cuidadosos! O mundo deveria ser meu!"
    },
    "defeat": {
      "1": "Kyurem! Use Absofusion!"
    }
  },
  "flare_boss_lysandre_1": {
    "encounter": {
      "1": "Você está aqui para me deter? Mostre-me em batalha."
    },
    "victory": {
      "1": "Você está aqui para me deter. Mas eu peço que você espere."
    },
    "defeat": {
      "1": "Pokémon... não devem mais existir."
    }
  },
  "flare_boss_lysandre_2": {
    "encounter": {
      "1": "O futuro que você quer, ou o futuro que eu quero... Vamos ver qual é o mais merecedor, não é mesmo?"
    },
    "victory": {
      "1": "Uau!"
    },
    "defeat": {
      "1": "Tolos sem visão continuarão a poluir este belo mundo."
    }
  },
  "aether_boss_lusamine_1": {
    "encounter": {
      "1": "Você vai assustar minha fera querida! Parece que eu vou precisar te silenciar primeiro."
    },
    "victory": {
      "1": "Como... como você pode ser tão terrível!"
    },
    "defeat": {
      "1": "Aff..."
    }
  },
  "aether_boss_lusamine_2": {
    "encounter": {
      "1": "Por que você continua a me incomodar?! Estou cansada de você. Cansada até a alma!\n$Chega de papo furado... Com o poder de Nihilego, vou mostrar o quão errado você estava em vir aqui!"
    },
    "victory": {
      "1": "Aaauuuggghhhhhhhhh!!!"
    },
    "defeat": {
      "1": "Tudo o que eu quero é minha fera preciosa! Eu não me importo com nenhum de vocês!"
    }
  },
  "skull_boss_guzma_1": {
    "encounter": {
      "1": "O odiado chefe que te bate e te bate e nunca para...\n$É. O grande e mau Guzma está aqui!"
    },
    "victory": {
      "1": "Tss. Eu vou te bater um dia desses!"
    },
    "defeat": {
      "1": "E você veio até aqui só pra isso, né?"
    }
  },
  "skull_boss_guzma_2": {
    "encounter": {
      "1": "Não importa contra quem eu esteja, eu vou derrotá-los!\n$Isso é o que o grande e mau Guzma é!"
    },
    "victory": {
      "1": "Guzma!!! O que há de errado com você?!"
    },
    "defeat": {
      "1": "Vocês são tudo uns idiotas!"
    }
  },
  "macro_boss_rose_1": {
    "encounter": {
      "1": "Devo fornecer energia ilimitada para garantir a prosperidade eterna para todos...\n$É meu propósito, meu dever, meu destino!"
    },
    "victory": {
      "1": "Você ainda não entendeu, treinador...\n$Nós... Não, eu vou mudar o rumo da história!"
    },
    "defeat": {
      "1": "Você ainda não entende nada!"
    }
  },
  "macro_boss_rose_2": {
    "encounter": {
      "1": "Estou comprometido em resolver o problema de energia na região de Galar e, claro, em todo o mundo.\n$Minha experiência e conquistas que fizeram da Macro Cosmos um sucesso são a prova de que meus métodos funcionam.\n$Não pretendo mudar de ideia, mesmo que eu perca."
    },
    "victory": {
      "1": "Eu esqueci o quão incríveis são as batalhas Pokémon! Faz tanto tempo desde que eu batalhei...\n$Isso foi realmente satisfatório, eu aceito a derrota para esta batalha."
    },
    "defeat": {
      "1": "Eu suponho que deve parecer que estou fazendo algo terrível. Eu não espero que você entenda.\n$Mas eu devo fornecer à região de Galar energia ilimitada para garantir prosperidade eterna."
    }
  },
  "brock": {
    "encounter": {
      "1": "Minha especialidade em Pokémon do tipo Pedra vai te derrubar! Vamos lá!",
      "2": "Minha vontade firme como pedra vai te sobrecarregar!",
      "3": "Permita-me mostrar a verdadeira força dos meus Pokémon!"
    },
    "victory": {
      "1": "A força dos seus Pokémon superou minhas defesas de pedra!",
      "2": "O mundo é enorme! Estou feliz por ter tido a chance de batalhar com você.",
      "3": "Talvez eu deva voltar a perseguir meu sonho de ser Criador de Pokémon…"
    },
    "defeat": {
      "1": "A melhor defesa é um bom ataque!\nEssa é a minha maneira de fazer as coisas!",
      "2": "Venha estudar rochas comigo da próxima vez para aprender melhor a combatê-las!",
      "3": "Hah, todas as minhas viagens pelas regiões estão valendo a pena!"
    }
  },
  "misty": {
    "encounter": {
      "1": "Minha política é um ataque total com Pokémon do tipo Água!",
      "2": "Oi, vou mostrar a força dos meus Pokémon aquáticos!",
      "3": "Meu sonho era viajar e batalhar com treinadores poderosos…\nVocê será um desafio suficiente?"
    },
    "victory": {
      "1": "Você realmente é forte… Vou admitir que você é habilidoso…",
      "1_female": "Você realmente é forte… Vou admitir que você é habilidosa…",
      "2": "Hmm… Você sabe que só teve sorte, certo?!",
      "3": "Uau, você é demais! Não acredito que me venceu!"
    },
    "defeat": {
      "1": "A poderosa Misty foi demais para você?",
      "2": "Espero que você tenha visto as técnicas de natação elegantes dos meus Pokémon!",
      "3": "Seus Pokémon não foram páreo para meus orgulhos e alegrias!"
    }
  },
  "lt_surge": {
    "encounter": {
      "1": "Meus Pokémon Elétricos me salvaram durante a guerra! Vou te mostrar como!",
      "2": "Em sentido! Vou te chocar até você se render!",
      "3": "Vou te eletrizar como faço com todos os meus inimigos na batalha!"
    },
    "victory": {
      "1": "Whoa! Seu time é de verdade, garoto!",
      "1_female": "Whoa! Seu time é de verdade, garota!",
      "2": "Uau, você é forte! Até meus truques elétricos perderam para você.",
      "3": "Isso foi uma derrota absolutamente chocante!"
    },
    "defeat": {
      "1": "Oh sim! Quando se trata de Pokémon do tipo Elétrico, sou o número um do mundo!",
      "2": "Hahaha! Foi uma batalha eletrizante, garoto!",
      "2_female": "Hahaha! Foi uma batalha eletrizante, garota!",
      "3": "Uma batalha de Pokémon é guerra, e eu te mostrei combate em primeira mão!"
    }
  },
  "erika": {
    "encounter": {
      "1": "Ah, o tempo está adorável aqui…\nOh, uma batalha? Muito bem então.",
      "2": "Minhas habilidades de batalha Pokémon rivalizam com minhas habilidades de arranjo de flores.",
      "3": "Oh, espero que o aroma agradável dos meus Pokémon não me faça dormir de novo…",
      "4": "Ver flores em um jardim é tão calmante."
    },
    "victory": {
      "1": "Oh! Eu concedo a derrota.",
      "2": "Aquela partida foi muito agradável.",
      "3": "Ah, parece que perdi…",
      "4": "Oh, meu Deus."
    },
    "defeat": {
      "1": "Tinha medo de adormecer…",
      "2": "Oh, meu Deus, parece que meus Pokémon de Grama te dominaram.",
      "3": "Essa batalha foi uma experiência tão calmante.",
      "4": "Oh… É só isso?"
    }
  },
  "janine": {
    "encounter": {
      "1": "Estou dominando a arte dos ataques venenosos.\nVou lutar com você hoje!",
      "2": "Meu pai confia que posso me defender.\nVou provar que ele está certo!",
      "3": "Minhas técnicas de ninja só perdem para as do meu pai!\nVocê consegue acompanhar?"
    },
    "victory": {
      "1": "Ainda preciso de treinamento… Entendi.",
      "2": "Sua técnica de batalha superou a minha.",
      "3": "Vou me aplicar de verdade e melhorar minhas habilidades."
    },
    "defeat": {
      "1": "Hehe… o veneno drenou todas as suas forças para lutar.",
      "2": "Ha! Você não teve chance contra minhas habilidades superiores de ninja!",
      "3": "A fé do meu pai em mim não foi mal colocada."
    }
  },
  "sabrina": {
    "encounter": {
      "1": "Através da minha habilidade psíquica, tive uma visão da sua chegada!",
      "2": "Não gosto de lutar, mas se você quiser, vou mostrar meus poderes!",
      "3": "Posso sentir grande ambição em você. Vou ver se não é infundada."
    },
    "victory": {
      "1": "Seu poder… Ele supera o que eu previa…",
      "2": "Não consegui prever seu poder com precisão.",
      "3": "Mesmo com meus imensos poderes psíquicos, não consigo sentir outro tão forte quanto você."
    },
    "defeat": {
      "1": "Essa vitória… É exatamente como previ nas minhas visões!",
      "2": "Talvez fosse outra pessoa que eu sentisse um grande desejo…",
      "3": "Aprimore suas habilidades antes de entrar em batalha precipitadamente.\nVocê nunca sabe o que o futuro pode reservar se fizer isso…"
    }
  },
  "blaine": {
    "encounter": {
      "1": "Hah! Espero que tenha trazido uma Cura de Queimadura!",
      "2": "Meus Pokémon de Fogo vão incinerar todos os desafiantes!",
      "3": "Prepare-se para brincar com fogo!"
    },
    "victory": {
      "1": "Queimei até não restar nada! Nem cinzas sobraram!",
      "2": "Não acendi as chamas alto o suficiente?",
      "3": "Estou completamente exausto… Mas isso faz minha motivação para melhorar queimar ainda mais!"
    },
    "defeat": {
      "1": "Meu inferno ardente não pode ser apagado!",
      "2": "Meus Pokémon foram fortalecidos com o calor desta vitória!",
      "3": "Hah! Minha paixão queima mais do que a sua!"
    }
  },
  "giovanni": {
    "encounter": {
      "1": "Eu, o líder da Equipe Rocket, vou te fazer sentir um mundo de dor!",
      "2": "Meu treinamento aqui será vital antes de enfrentar meus antigos associados novamente.",
      "3": "Não acho que você está preparado para o nível de fracasso que está prestes a experimentar!",
      "3_female": "Não acho que você está preparada para o nível de fracasso que está prestes a experimentar!"
    },
    "victory": {
      "1": "O QUE! Eu, perder?! Não tenho nada a dizer a você!",
      "2": "Hmm… Você nunca entenderia o que quero alcançar.",
      "3": "Esta derrota está apenas adiando o inevitável.\nVou ressurgir a Equipe Rocket das cinzas a tempo."
    },
    "defeat": {
      "1": "Não ser capaz de medir sua própria força mostra que você ainda é apenas uma criança.",
      "2": "Não tente interferir comigo novamente.",
      "3": "Espero que entenda o quão tolo foi me desafiar."
    }
  },
  "roxanne": {
    "encounter": {
      "1": "Você poderia gentilmente demonstrar como batalha?",
      "2": "Você pode aprender muitas coisas batalhando com muitos treinadores.",
      "3": "Oh, você me pegou estrategizando.\nGostaria de batalhar?"
    },
    "victory": {
      "1": "Oh, parece que perdi.\nEu entendo.",
      "2": "Parece que ainda tenho muito mais a aprender quando se trata de batalhas.",
      "3": "Vou levar o que aprendi aqui hoje a sério."
    },
    "defeat": {
      "1": "Aprendi muitas coisas com nossa batalha.\nEspero que você também tenha aprendido.",
      "2": "Espero batalhar com você novamente.\nEspero que use o que aprendeu aqui.",
      "3": "Venci devido a tudo o que aprendi."
    }
  },
  "brawly": {
    "encounter": {
      "1": "Oh cara, um desafiante!\nVamos ver o que você pode fazer!",
      "1_female": "Oh cara, uma desafiante!\nVamos ver o que você pode fazer!",
      "2": "Você parece uma grande onda.\nVamos batalhar!",
      "3": "Hora de criar uma tempestade!\nVamos!"
    },
    "victory": {
      "1": "Uau, você me derrotou!",
      "2": "Você surfou minha onda e me derrubou!",
      "3": "Sinto-me perdido na Caverna Granito!"
    },
    "defeat": {
      "1": "Haha, eu surfei a grande onda!\nDesafie-me novamente algum dia.",
      "2": "Surfe comigo novamente algum dia!",
      "3": "Assim como as marés vão e vêm, espero que você volte para me desafiar novamente."
    }
  },
  "wattson": {
    "encounter": {
      "1": "Hora de levar um choque!\nWahahahaha!",
      "2": "Vou fazer faíscas voarem!\nWahahahaha!",
      "3": "Espero que tenha trazido Cura de Paralisia!\nWahahahaha!"
    },
    "victory": {
      "1": "Parece que estou sem carga!\nWahahahaha!",
      "2": "Você me aterrissou completamente!\nWahahahaha!",
      "3": "Obrigado pela emoção!\nWahahahaha!"
    },
    "defeat": {
      "1": "Você está totalmente carregado agora!\nWahahahaha!",
      "1_female": "Você está totalmente carregada agora!\nWahahahaha!",
      "2": "Espero ver você faíscando em batalhas futuras!\nWahahahaha!",
      "3": "Wahahahaha! Que batalha eletrizante!"
    }
  },
  "flannery": {
    "encounter": {
      "1": "Meus Pokémon de fogo estão prontos para queimar a concorrência!\nVamos nessa!",
      "2": "Prepare-se para sentir o calor da minha determinação!\nNão vou segurar nada!",
      "3": "Minhas habilidades vão incinerar você!\nPrepare-se para a batalha mais quente da sua vida!"
    },
    "victory": {
      "1": "Essa derrota só faz minha determinação queimar mais!",
      "2": "Essa perda não apagará minhas chamas!\nEstarei de volta mais forte!",
      "3": "Vou usar essa experiência para reacender meu espírito competitivo!"
    },
    "defeat": {
      "1": "Minhas chamas nunca se apagarão!\nSou muito apaixonada por isso!",
      "2": "Você foi incrível!\nVamos fazer isso de novo algum dia!",
      "3": "Que batalha ardente!\nMal posso esperar pela próxima!"
    }
  },
  "norman": {
    "encounter": {
      "1": "Você está pronto para enfrentar a força pura do meu time?\nVou te mostrar o poder do equilíbrio!",
      "2": "Minha experiência em batalha vai fazer você suar!\nPrepare-se!",
      "3": "Treinei meu time rigorosamente.\nVamos ver se você consegue igualar!"
    },
    "victory": {
      "1": "Parece que subestimei você.\nFoi uma batalha dura.",
      "2": "Você é forte, mas ainda há muito para aprender.",
      "3": "Essa derrota não abalará minha determinação.\nEstarei de volta mais forte!"
    },
    "defeat": {
      "1": "Você lutou bravamente!\nEspero batalhar com você novamente.",
      "2": "Sua força é incrível!\nNão posso esperar pela nossa próxima batalha.",
      "3": "Foi uma honra batalhar com você!\nAté a próxima!"
    }
  },
  "winona": {
    "encounter": {
      "1": "Tenho sobrevoado os céus em busca de presas...\nE você é meu alvo!",
      "2": "Não importa como será nossa batalha, meus Pokémon Voadores e eu triunfaremos com graça. Vamos batalhar!",
      "3": "Espero que você não tenha medo de altura.\nVamos subir!"
    },
    "victory": {
      "1": "Você é o primeiro Treinador que vejo com mais graça do que eu.\nJogou excelentemente.",
      "1_female": "Você é a primeira Treinadora que vejo com mais graça do que eu.\nJogou excelentemente.",
      "2": "Oh, meus Pokémon Voadores despencaram!\nMuito bem.",
      "3": "Embora eu tenha caído, meus Pokémon continuarão a voar!"
    },
    "defeat": {
      "1": "Meus Pokémon Voadores e eu sempre dançaremos com elegância!",
      "2": "Espero que tenha gostado do nosso show.\nNossa dança graciosa terminou.",
      "3": "Você não quer ver nossa coreografia elegante novamente?"
    }
  },
  "tate": {
    "encounter": {
      "1": "Hehehe... Ficou surpreso de me ver sem minha irmã?",
      "1_female": "Hehehe... Ficou surpresa de me ver sem minha irmã?",
      "2": "Posso ver o que você está pensando...\nVocê quer batalhar!",
      "3": "Como você pode derrotar alguém...\nQue sabe todos os seus movimentos?"
    },
    "victory": {
      "1": "Não pode ser ajudado...\nSinto falta da Liza...",
      "2": "Seu vínculo com seus Pokémon era mais forte que o meu.",
      "3": "Se eu estivesse com Liza, teríamos vencido.\nConseguimos completar os pensamentos um do outro!"
    },
    "defeat": {
      "1": "Meus Pokémon e eu somos superiores!",
      "2": "Se você não consegue nem me derrotar, nunca será capaz de derrotar Liza também.",
      "3": "Tudo graças ao meu treinamento rigoroso com Liza.\nPosso me tornar um com os Pokémon."
    }
  },
  "liza": {
    "encounter": {
      "1": "Fufufu... Ficou surpreso de me ver sem meu irmão?",
      "1_female": "Fufufu... Ficou surpresa de me ver sem meu irmão?",
      "2": "Posso determinar o que você deseja...\nVocê quer batalhar, não quer?",
      "3": "Como você pode derrotar alguém...\nQue é um com seus Pokémon?"
    },
    "victory": {
      "1": "Não pode ser ajudado...\nSinto falta do Tate...",
      "2": "Seu vínculo com seus Pokémon...\nÉ mais forte que o meu.",
      "3": "Se eu estivesse com Tate, teríamos vencido.\nPodemos terminar as frases um do outro!"
    },
    "defeat": {
      "1": "Meus Pokémon e eu somos vitoriosos.",
      "2": "Se você não consegue nem me derrotar, nunca será capaz de derrotar Tate também.",
      "3": "Tudo graças ao meu treinamento rigoroso com Tate.\nPosso me sincronizar com meus Pokémon."
    }
  },
  "juan": {
    "encounter": {
      "1": "Agora não é hora de agir timidamente.\nVamos batalhar!",
      "2": "Ahahaha, você será testemunha da minha arte com Pokémon de Água!",
      "3": "Um tufão se aproxima!\nVocê será capaz de me testar?",
      "4": "Por favor, você será testemunha da nossa arte.\nUma grande ilusão de água esculpida por meus Pokémon e por mim!"
    },
    "victory": {
      "1": "Você pode ser um gênio que pode enfrentar Wallace!",
      "2": "Eu me concentrei na elegância enquanto você treinava.\nÉ natural que você me derrotasse.",
      "3": "Ahahaha!\nMuito bem, você venceu desta vez.",
      "4": "De você, sinto o brilho brilhante da habilidade que superará tudo."
    },
    "defeat": {
      "1": "Meus Pokémon e eu esculpimos uma ilusão de Água e saímos vitoriosos.",
      "2": "Ahahaha, eu venci, e você perdeu.",
      "3": "Posso emprestar meu traje? Pode te ajudar a batalhar!\nAhahaha, estou brincando!",
      "4": "Eu sou o vencedor! O que quer dizer, você perdeu."
    }
  },
  "crasher_wake": {
    "encounter": {
      "1": "Crash! Crash! Cuidado!\nDemolidor Wake… está… aqui!",
      "2": "Crash! Crash! Demolidor Wake!",
      "3": "Sou a onda de poder que vai te lavar!"
    },
    "victory": {
      "1": "Isso coloca um sorriso no meu rosto!\nGuhahaha! Foi uma explosão!",
      "2": "Hunwah! Acabou e terminou!\nComo vou dizer isso...\nQuero mais! Queria batalhar muito mais!",
      "3": "O QUÊ?!"
    },
    "defeat": {
      "1": "Siiiiim! Isso mesmo!",
      "2": "Eu venci, mas quero mais! Queria batalhar muito mais!",
      "3": "Até logo!"
    }
  },
  "falkner": {
    "encounter": {
      "1": "Vou mostrar o verdadeiro poder dos magníficos Pokémon pássaros!",
      "2": "Ventos, fiquem comigo!",
      "3": "Pai! Espero que esteja vendo minha batalha de cima!"
    },
    "victory": {
      "1": "Eu entendo... Vou sair graciosamente.",
      "2": "Uma derrota é uma derrota. Você é realmente forte.",
      "3": "...Droga! Sim, eu perdi."
    },
    "defeat": {
      "1": "Pai! Venci com seus amados Pokémon pássaros...",
      "2": "Pokémon pássaros são os melhores afinal!",
      "3": "Sinto que estou alcançando meu pai!"
    }
  },
  "nessa": {
    "encounter": {
      "1": "Não importa que tipo de plano sua mente refinada possa estar tramando, meu parceiro e eu vamos afundá-lo.",
      "1_female": "Não importa que tipo de plano sua mente refinada possa estar tramando, meu parceiro e eu vamos afundá-la.",
      "2": "Não estou aqui para conversar. Estou aqui para vencer!",
      "3": "Este é um pequeno presente dos meus Pokémon... Espero que você possa recebê-lo!",
      "3_female": "Este é um pequeno presente dos meus Pokémon... Espero que você possa recebê-la!"
    },
    "victory": {
      "1": "Você e seus Pokémon são demais...",
      "2": "Como...? Como isso pode ser?!",
      "3": "Fui totalmente arrastada!"
    },
    "defeat": {
      "1": "A onda furiosa ataca novamente!",
      "2": "Hora de surfar na onda da vitória!",
      "3": "Hehe!"
    }
  },
  "melony": {
    "encounter": {
      "1": "Não vou me segurar!",
      "2": "Tudo bem, acho que devemos começar.",
      "3": "Vou congelar você completamente!"
    },
    "victory": {
      "1": "Você... Você é muito bom, hein?",
      "1_female": "Você... Você é muito boa, hein?",
      "2": "Se você encontrar Gordie por aí, certifique-se de dar uma boa surra nele, ok?",
      "3": "Acho que você levou a quebra de gelo um pouco literalmente demais..."
    },
    "defeat": {
      "1": "Agora você vê como as batalhas podem ser severas?",
      "2": "Hee! Parece que ganhei de novo!",
      "3": "Você está segurando?"
    }
  },
  "marlon": {
    "encounter": {
      "1": "Você parece forte! Vamos começar!",
      "2": "Sou forte como a amplitude do oceano. Você vai ser varrido, com certeza.",
      "2_female": "Sou forte como a amplitude do oceano. Você vai ser varrida, com certeza.",
      "3": "Oh ho, então estou enfrentando você! Isso é fora do comum."
    },
    "victory": {
      "1": "Você foi incrível! Está criando alguns Pokémon incríveis. Você dominou a coisa de Treinador!",
      "1_female": "Você foi incrível! Está criando alguns Pokémon incríveis. Você dominou a coisa de Treinadora!",
      "2": "Você não apenas parece forte, você é forte de verdade! Eh, eu também fui varrido!",
      "3": "Você é forte como uma onda impressionante!"
    },
    "defeat": {
      "1": "Você é forte, mas não é o suficiente para mudar o mar, ok!",
      "2": "Hee! Parece que ganhei de novo!",
      "3": "Doce, doce vitória!"
    }
  },
  "shauntal": {
    "encounter": {
      "1": "Com licença. Você é um desafiante, certo?\nSou a usuária de Pokémon do tipo Fantasma da Elite dos Quatro, Shauntal, e serei sua oponente.",
      "1_female": "Com licença. Você é uma desafiante, certo?\nSou a usuária de Pokémon do tipo Fantasma da Elite dos Quatro, Shauntal, e serei sua oponente.",
      "2": "Adoro escrever sobre Treinadores que vêm aqui e os Pokémon que treinam.\nPosso usar você e seus Pokémon como tema?",
      "3": "Cada pessoa que trabalha com Pokémon tem uma história para contar.\nQue história está prestes a ser contada?"
    },
    "victory": {
      "1": "Uau. Estou sem palavras!",
      "2": "D-desculpe! Primeiro, preciso me desculpar com meus Pokémon...\n\nLamento muito que você tenha tido uma experiência ruim por minha causa!",
      "3": "Mesmo com isso, ainda sou uma da Elite dos Quatro!"
    },
    "defeat": {
      "1": "Hehe.",
      "2": "Isso me deu um excelente material para meu próximo romance!",
      "3": "E assim, outra história termina..."
    }
  },
  "marshal": {
    "encounter": {
      "1": "Meu mentor, Alder, vê seu potencial como Treinador e está interessado em você.\nMeu objetivo é testá-lo—levar você aos limites da sua força. Kiai!",
      "1_female": "Meu mentor, Alder, vê seu potencial como Treinadora e está interessado em você.\nMeu objetivo é testá-la—levar você aos limites da sua força. Kiai!",
      "2": "Vitória, vitória decisiva, é meu objetivo! Desafiante, aqui vou eu!",
      "3": "Em mim mesmo, procuro desenvolver a força de um lutador e eliminar qualquer fraqueza em mim!\nPrevalecendo com a força de minhas convicções!"
    },
    "victory": {
      "1": "Ufa! Bem feito!",
      "2": "À medida que suas batalhas continuarem, mire em alturas ainda maiores!",
      "3": "A força demonstrada por você e seus Pokémon me impressionou profundamente..."
    },
    "defeat": {
      "1": "Hmm.",
      "2": "Isso foi uma boa batalha.",
      "3": "Haaah! Haaah! Haiyaaaah!"
    }
  },
  "cheren": {
    "encounter": {
      "1": "Você me lembra um velho amigo. Isso me deixa animado para essa batalha Pokémon!",
      "2": "As batalhas Pokémon não têm sentido se você não pensa por que você batalha.\nOu melhor, isso torna as batalhas junto com Pokémon sem sentido.",
      "3": "Meu nome é Cheren! Sou um Líder de Ginásio e professor! Prazer em conhecê-lo.",
      "3_female": "Meu nome é Cheren! Sou um Líder de Ginásio e professor! Prazer em conhecê-la."
    },
    "victory": {
      "1": "Obrigado! Vi o que estava faltando em mim.",
      "2": "Obrigado! Sinto que vi um pouco do caminho em direção aos meus ideais.",
      "3": "Hmm... Isso é problemático."
    },
    "defeat": {
      "1": "Como Líder de Ginásio, meu objetivo é ser um obstáculo para você superar.",
      "2": "Tudo bem!",
      "3": "Cheguei onde estou porque os Pokémon estavam ao meu lado.\nTalvez precisemos pensar por que os Pokémon nos ajudam, não em termos de Pokémon e Treinadores, mas como uma relação entre seres vivos."
    }
  },
  "chili": {
    "encounter": {
      "1": "Ihuuu! Hora de brincar com FOGO!! Sou o mais forte dos nossos irmãos!",
      "1_female": "Yeeeeeooow! Hora de brincar com FOGO!! Eu sou o mais forte de nós irmãos!",
      "2": "Ta-da! O incendiário do tipo Fogo Chili—sou eu—será seu oponente!",
      "2_female": "Tcharan! O escaldante Chili tipo Fogo (sou eu) será seu oponente!",
      "3": "Vou mostrar o que eu e meus tipos de Fogo podemos fazer!",
      "3_female": "Vou te mostrar o que eu e meus ardentes tipo Fogo podemos fazer!"
    },
    "victory": {
      "1": "Você me pegou. Estou... queimado...",
      "1_female": "Você me pegou. Eu estou… queimado… esgotado…",
      "2": "Uau! Você está pegando fogo!",
      "2_female": "Uau! Você tá pegando fogo!",
      "3": "Ai! Você me pegou!"
    },
    "defeat": {
      "1": "Estou pegando fogo! Jogue comigo, e você se queimará!",
      "1_female": "Estou pegando fogo! Brinque comigo e você vai se queimar!",
      "2": "Quando você brinca com fogo, você se queima!",
      "3": "Quero dizer, vamos lá, seu oponente era eu! Você não tinha chance!",
      "3_female": "Quero dizer, fala sério, seu oponente era eu! Você não teve chance!"
    }
  },
  "cilan": {
    "encounter": {
      "1": "Nada pessoal... Sem ressentimentos... Eu e meus Pokémon do tipo Grama vamos...\nUm... Vamos batalhar, aconteça o que acontecer.",
      "1_female": "Nada pessoal... Sem ressentimentos... Eu e meus Pokémon do tipo Grama vamos...\n$Hum... Nós iremos batalhar, aconteça o que acontecer.",
      "2": "Então, hum, se você está bem comigo, vou, hum, colocar tudo o que tenho em ser, er, você sabe, seu oponente.",
      "2_female": "Então, hum, se você estiver bem comigo, eu vou, hum, dar tudo o que tenho para ser, hum, você sabe, seu oponente.",
      "3": "OK… Então, hum, eu sou o Cilan, gosto de Pokémon do tipo Grama.",
      "3_female": "OK... Então, eu sou Cilan, eu gosto de Pokémon do tipo Grama."
    },
    "victory": {
      "1": "Er... Acabou agora?",
      "1_female": "Er… Já acabou?",
      "2": "…Que surpresa. Você é muito forte, não é?\nAcho que meus irmãos também não teriam sido capazes de te derrotar...",
      "2_female": "…Que surpresa. Você é muito forte, não é? \n$Eu acho que meus irmãos também não conseguiriam derrotar você…",
      "3": "…Huh. Parece que meu timing estava, hum, errado?"
    },
    "defeat": {
      "1": "Huh? Ganhei?",
      "1_female": "Hein? Eu ganhei?",
      "2": "Acho...\nSuponho que ganhei, porque competi com meus irmãos Chili e Cress, e todos conseguimos ficar mais fortes.",
      "2_female": "Eu acho... \n$Eu acho que ganhei, porque eu estava competindo com meus irmãos Chili e Cress, e todos nós conseguimos ficar mais fortes.",
      "3": "Foi... uma experiência bastante emocionante...",
      "3_female": "Foi… foi uma experiência bastante emocionante…"
    }
  },
  "roark": {
    "encounter": {
      "1": "Preciso ver seu potencial como Treinador. E, vou precisar ver a dureza dos Pokémon que batalham com você!",
      "1_female": "Preciso ver seu potencial como Treinadora. E, vou precisar ver a dureza dos Pokémon que batalham com você!",
      "2": "Vamos lá! Estes são meus Pokémon de pedra, meu orgulho e alegria!",
      "3": "Pokémon do tipo Pedra são simplesmente os melhores!",
      "4": "Preciso ver seu potencial como Treinador. E, vou precisar ver a dureza dos Pokémon que batalham com você!",
      "4_female": "Preciso ver seu potencial como Treinadora. E, vou precisar ver a dureza dos Pokémon que batalham com você!"
    },
    "victory": {
      "1": "O-o que? Isso não pode ser! Meus Pokémon fortificados!",
      "2": "...Perdemos o controle. Da próxima vez, gostaria de desafiá-lo a uma corrida de escavação de fósseis no subsolo.",
      "2_female": "...Perdemos o controle. Da próxima vez, gostaria de desafiá-la a uma corrida de escavação de fósseis no subsolo.",
      "3": "Com habilidade como a sua, é natural que você vença.",
      "4": "O-o que?! Não pode ser! Nem isso foi suficiente?",
      "5": "Eu estraguei tudo."
    },
    "defeat": {
      "1": "Veja? Estou orgulhoso do meu estilo de batalha rochoso!",
      "2": "Obrigado! A batalha me deu confiança de que talvez eu consiga vencer meu pai!",
      "3": "Sinto como se tivesse acabado de quebrar uma pedra muito teimosa!"
    }
  },
  "morty": {
    "encounter": {
      "1": "Com um pouco mais, eu poderia ver um futuro em que encontro o Pokémon lendário.\nVocê vai me ajudar a alcançar esse nível!",
      "2": "Dizem que um Pokémon com cores de arco-íris aparecerá diante de um Treinador verdadeiramente poderoso.\nAcreditei nessa história, então treinei secretamente aqui a vida toda. Como resultado, agora posso ver o que os outros não podem.\nVejo uma sombra da pessoa que fará o Pokémon aparecer.\nAcredito que essa pessoa sou eu! Você vai me ajudar a alcançar esse nível!",
      "3": "Quer você escolha acreditar ou não, o poder místico existe.",
      "4": "Você pode testemunhar os frutos do meu treinamento.",
      "5": "Você deve fazer sua alma se tornar uma com a dos Pokémon. Você pode fazer isso?",
      "6": "Diga, você quer fazer parte do meu treinamento?"
    },
    "victory": {
      "1": "Ainda não sou bom o suficiente...",
      "2": "Eu vejo... Sua jornada o levou a lugares distantes e você testemunhou muito mais do que eu.\nEu invejo você por isso...",
      "2_female": "Eu vejo... Sua jornada a levou a lugares distantes e você testemunhou muito mais do que eu.\nEu invejo você por isso...",
      "3": "Como isso é possível...",
      "4": "Não acho que nossos potenciais sejam tão diferentes.\nMas você parece ter algo mais do que isso... Que seja.",
      "5": "Acho que preciso de mais treinamento.",
      "6": "Isso é uma pena."
    },
    "defeat": {
      "1": "Eu me movi... mais um passo adiante.",
      "2": "Fufufu...",
      "3": "O-o que?! Não pode ser! Nem isso foi suficiente?",
      "4": "Sinto como se tivesse acabado de quebrar uma pedra muito teimosa!",
      "5": "Ahahahah!",
      "6": "Eu sabia que venceria!"
    }
  },
  "crispin": {
    "encounter": {
      "1": "Quero vencer, então é exatamente isso que vou fazer!",
      "2": "Eu batalho porque quero batalhar! E sabe de uma coisa? É assim que deve ser!"
    },
    "victory": {
      "1": "Queria vencer... mas perdi!",
      "2": "Eu perdi... porque não consegui vencer!"
    },
    "defeat": {
      "1": "Ei, espere um segundo. Eu acabei de vencer? Acho que acabei de vencer! Que satisfação!",
      "2": "Uou! Isso foi incrível!"
    }
  },
  "amarys": {
    "encounter": {
      "1": "Quero ser a pessoa a ajudar alguém em particular. Sendo assim, não posso me dar ao luxo de perder.\n... Nossa batalha começa agora."
    },
    "victory": {
      "1": "Eu sou... não o suficiente, eu vejo."
    },
    "defeat": {
      "1": "A vitória pertence a mim. Bem lutado."
    }
  },
  "lacey": {
    "encounter": {
      "1": "Vou enfrentar você com meu time usual como membro da Elite dos Quatro."
    },
    "victory": {
      "1": "Foi uma excelente batalha. Estou ansiosa para o próximo desafio."
    },
    "defeat": {
      "1": "Fufufu... Nada mal.\nDesafiantes que derrotam a Elite dos Quatro são dignos de notar."
    }
  },
  "drayton": {
    "encounter": {
      "1": "Cara, eu amo cadeiras. Você não ama cadeiras? Que salva-vidas.\n$Não entendo por que todo mundo não fica sentado o tempo todo. Ficar de pé é cansativo!"
    },
    "victory": {
      "1": "Acho que deveria ter esperado por isso!"
    },
    "defeat": {
      "1": "Heh heh! Não ligue para mim, só pegando uma vitória aqui. Entendo se você estiver chateado, mas não vá dar uma de Kieran comigo, OK?",
      "1_female": "Heh heh! Não ligue para mim, só pegando uma vitória aqui. Entendo se você estiver chateada, mas não vá dar uma de Kieran comigo, OK?"
    }
  },
  "ramos": {
    "encounter": {
      "1": "Você gostou do jardim de diversão que fiz com todas essas plantas resistentes minhas?\n$A força delas é um sinal da minha força como jardineiro e Líder de Ginásio! Você tem certeza de que está pronto para enfrentar tudo isso?",
      "1_female": "Você gostou do jardim de diversão que fiz com todas essas plantas resistentes minhas?\n$A força delas é um sinal da minha força como jardineiro e Líder de Ginásio! Você tem certeza de que está pronta para enfrentar tudo isso?"
    },
    "victory": {
      "1": "Você acredita nos seus Pokémon... E eles acreditam em você também... Foi uma boa batalha, broto."
    },
    "defeat": {
      "1": "Hohoho... De fato. Pequenas lâminas frágeis de grama conseguem quebrar até mesmo concreto."
    }
  },
  "viola": {
    "encounter": {
      "1": "Seja as lágrimas de frustração que seguem uma derrota ou o florescer da alegria que vem com a vitória…\n$Ambos são ótimos temas para minha câmera! Fantástico! Isso vai ser simplesmente fantástico!\n$Agora venha para cima de mim!",
      "2": "Minha lente está sempre focada na vitória – não vou deixar nada estragar esta foto!"
    },
    "victory": {
      "1": "Você e seus Pokémon me mostraram uma nova profundidade de campo! Fantástico! Simplesmente fantástico!",
      "2": "O mundo que você vê através de uma lente, e o mundo que você vê com um Pokémon ao seu lado…\n$O mesmo mundo pode parecer completamente diferente dependendo do seu ponto de vista."
    },
    "defeat": {
      "1": "A foto do momento da minha vitória vai ser um verdadeiro sucesso!",
      "2": "Sim! Tirei ótimas fotos!"
    }
  },
  "candice": {
    "encounter": {
      "1": "Você quer desafiar a Candice? Com certeza! Eu estava esperando por alguém forte!\n$Mas devo te avisar, sou forte porque sei como focar.",
      "2": "Pokémon, moda, romance… É tudo uma questão de foco!\n$Vou te mostrar exatamente o que quero dizer. Prepare-se para perder!"
    },
    "victory": {
      "1": "Devo dizer, estou aquecida para você! Posso até te admirar um pouco.",
      "2": "Uau! Você é ótimo! Ganhou meu respeito!\n$Acho que seu foco e vontade nos derrubaram totalmente.",
      "2_female": "Uau! Você é ótima! Ganhou meu respeito!\n$Acho que seu foco e vontade nos derrubaram totalmente."
    },
    "defeat": {
      "1": "Eu senti sua vontade de vencer, mas eu não perco!",
      "2": "Viu? O foco da Candice! O foco dos meus Pokémon também é ótimo!"
    }
  },
  "gardenia": {
    "encounter": {
      "1": "Você tem uma aura vencedora. Então, de qualquer forma, isso vai ser divertido. Vamos ter nossa batalha!"
    },
    "victory": {
      "1": "Incrível! Você é muito bom, não é?",
      "1_female": "Incrível! Você é muito boa, não é?"
    },
    "defeat": {
      "1": "Sim! Meus Pokémon e eu somos perfeitamente bons!"
    }
  },
  "aaron": {
    "encounter": {
      "1": "Ok! Deixe-me enfrentar você!"
    },
    "victory": {
      "1": "Batalhar é um assunto profundo e complexo..."
    },
    "defeat": {
      "1": "Vencer um membro da Elite dos Quatro não é fácil."
    }
  },
  "cress": {
    "encounter": {
      "1": "Isso mesmo! Serei eu e meus estimados tipos Água que você deve enfrentar na batalha!"
    },
    "victory": {
      "1": "Perder? Eu? Não acredito nisso."
    },
    "defeat": {
      "1": "Este é o resultado apropriado quando eu sou seu oponente."
    }
  },
  "allister": {
    "encounter": {
      "1": "Sou Allister.\nA-aqui... vou eu..."
    },
    "victory": {
      "1": "Quase perdi minha máscara de tanto choque... Isso foi…\n$Uau. Posso ver sua habilidade pelo que ela é."
    },
    "defeat": {
      "1": "I-isso foi incrível!"
    }
  },
  "clay": {
    "encounter": {
      "1": "Harrumph! Me deixou esperando, não foi, garoto? Tudo bem, hora de ver o que você pode fazer!",
      "1_female": "Harrumph! Me deixou esperando, não foi, garota? Tudo bem, hora de ver o que você pode fazer!"
    },
    "victory": {
      "1": "Cara, como é bom dar tudo de si e ainda assim ser derrotado!"
    },
    "defeat": {
      "1": "O que importa é como você reage à derrota.\n$É por isso que as pessoas que usam a derrota como combustível para melhorar são duras."
    }
  },
  "kofu": {
    "encounter": {
      "1": "Vou te servir um prato completo de Pokémon do tipo Água! Mas não tente comê-los!"
    },
    "victory": {
      "1": "Vaultin' Veluza! Você é animado, não é! Um pouco ANIMADO DEMAIS, se me permite dizer!",
      "1_female": "Vaultin' Veluza! Você é animada, não é! Um pouco ANIMADA DEMAIS, se me permite dizer!"
    },
    "defeat": {
      "1": "Volte para me ver novamente, ouviu?"
    }
  },
  "tulip": {
    "encounter": {
      "1": "Permita-me usar minhas habilidades para deixar seus lindos Pokémon ainda mais bonitos!"
    },
    "victory": {
      "1": "Sua força tem uma magia que não pode ser apagada."
    },
    "defeat": {
      "1": "Você sabe, na minha linha de trabalho, pessoas que carecem de talento em uma área ou outra frequentemente desaparecem rapidamente - nunca mais se ouve falar delas."
    }
  },
  "sidney": {
    "encounter": {
      "1": "Gostei desse olhar que você me deu. Acho que você vai ser um bom desafio.\n$Isso é ótimo! Parece muito bom! Vamos nessa!\n$Você e eu, vamos curtir uma batalha que só pode acontecer aqui!"
    },
    "victory": {
      "1": "E aí, gostou? Eu perdi! Mas foi divertido, então não importa."
    },
    "defeat": {
      "1": "Sem ressentimentos, beleza?"
    }
  },
  "phoebe": {
    "encounter": {
      "1": "Enquanto treinava, adquiri a habilidade de me comunicar com Pokémon do tipo Fantasma. \n$Sim, o vínculo que desenvolvi com os Pokémon é extremamente forte. \n$Então, vamos lá, tente ver se você consegue até mesmo causar dano aos meus Pokémon!"
    },
    "victory": {
      "1": "Ah, droga. Eu perdi."
    },
    "defeat": {
      "1": "Estou ansiosa para batalhar com você de novo algum dia!"
    }
  },
  "glacia": {
    "encounter": {
      "1": "Tudo o que vi foram desafios de Treinadores fracos e seus Pokémon. \n$E você? Ficaria extremamente satisfeita se pudesse dar tudo de mim contra você!"
    },
    "victory": {
      "1": "Você e seus Pokémon… Como seus espíritos queimam!\n$O calor consumido é esmagador. \n$Não é surpresa que minhas habilidades geladas falharam em te machucar."
    },
    "defeat": {
      "1": "Uma batalha intensamente apaixonada, sem dúvida."
    }
  },
  "drake": {
    "encounter": {
      "1": "Para nós, batalhar com Pokémon como parceiros, você sabe o que é necessário? Você sabe o que precisa? \n$Se não souber, nunca prevalecerá contra mim!"
    },
    "victory": {
      "1": "Excelente, deve-se dizer."
    },
    "defeat": {
      "1": "Dei meu máximo nessa batalha!"
    }
  },
  "wallace": {
    "encounter": {
      "1": "Há algo em você… Uma diferença na sua postura. \n$Acho que sinto isso em você. Agora, me mostre. Mostre-me o poder que você tem com seus Pokémon. \n$E eu, por minha vez, apresentarei uma performance de ilusões na água com meus Pokémon!"
    },
    "victory": {
      "1": "Bravo. Agora percebo sua autenticidade e magnificência como Treinador de Pokémon. \n$Tenho muita alegria em ter conhecido você e seus Pokémon. Você se mostrou digno.",
      "1_female": "Bravo. Agora percebo sua autenticidade e magnificência como Treinadora de Pokémon. \n$Tenho muita alegria em ter conhecido você e seus Pokémon. Você se mostrou digna."
    },
    "defeat": {
      "1": "Uma grande ilusão!"
    }
  },
  "lorelei": {
    "encounter": {
      "1": "Ninguém me supera quando se trata de Pokémon gelados! Movimentos congelantes são poderosos!\n$Seus Pokémon estarão à minha mercê quando estiverem congelados! Hahaha! Está pronto?",
      "1_female": "Ninguém me supera quando se trata de Pokémon gelados! Movimentos congelantes são poderosos!\n$Seus Pokémon estarão à minha mercê quando estiverem congelados! Hahaha! Está pronta?"
    },
    "victory": {
      "1": "Como ousa!"
    },
    "defeat": {
      "1": "Não há nada que você possa fazer quando está congelado.",
      "1_female": "Não há nada que você possa fazer quando está congelada."
    }
  },
  "will": {
    "encounter": {
      "1": "Treinei por todo o mundo, tornando meus Pokémon psíquicos poderosos.\n$Eu só posso melhorar! Perder não é uma opção!"
    },
    "victory": {
      "1": "Eu… Eu não… acredito…"
    },
    "defeat": {
      "1": "Isso foi por pouco. Me pergunto o que está faltando em você."
    }
  },
  "malva": {
    "encounter": {
      "1": "Sinto que meu coração pode explodir em chamas. \n$Estou ardendo de ódio por você, pirralho!",
      "1_female": "Sinto que meu coração pode explodir em chamas. \n$Estou ardendo de ódio por você, pirralha!"
    },
    "victory": {
      "1": "Que novidade… Um novo desafiador derrotou Malva!",
      "1_female": "Que novidade… Uma nova desafiadora derrotou Malva!"
    },
    "defeat": {
      "1": "Estou encantada! Sim, encantada por poder esmagar você sob meu calcanhar."
    }
  },
  "hala": {
    "encounter": {
      "1": "O velho Hala está aqui para fazer você gritar!"
    },
    "victory": {
      "1": "Pude sentir o poder que você ganhou na sua jornada."
    },
    "defeat": {
      "1": "Haha! Que batalha deliciosa!"
    }
  },
  "molayne": {
    "encounter": {
      "1": "Dei a posição de capitão ao meu primo Sophocles, mas estou confiante na minha habilidade. \n$Minha força é como a de uma supernova!"
    },
    "victory": {
      "1": "Certamente encontrei um Treinador interessante para enfrentar!",
      "1_female": "Certamente encontrei uma Treinadora interessante para enfrentar!"
    },
    "defeat": {
      "1": "Ahaha. Que batalha interessante."
    }
  },
  "rika": {
    "encounter": {
      "1": "Eu diria que vou pegar leve com você, mas… estaria mentindo! Pense rápido!"
    },
    "victory": {
      "1": "Nada mal, garoto.",
      "1_female": "Nada mal, garota."
    },
    "defeat": {
      "1": "Nahahaha! Você realmente é algo mais, garoto!",
      "1_female": "Nahahaha! Você realmente é algo mais, garota!"
    }
  },
  "bruno": {
    "encounter": {
      "1": "Nós vamos te triturar com nosso poder superior! Hoo hah!"
    },
    "victory": {
      "1": "Por quê? Como eu poderia perder?"
    },
    "defeat": {
      "1": "Você pode me desafiar o quanto quiser, mas os resultados nunca vão mudar!"
    }
  },
  "bugsy": {
    "encounter": {
      "1": "Sou Bugsy! Eu nunca perco quando se trata de Pokémon do tipo Inseto!"
    },
    "victory": {
      "1": "Uau, incrível! Você é um especialista em Pokémon!\nMinha pesquisa ainda não está completa. OK, você venceu.",
      "1_female": "Uau, incrível! Você é uma especialista em Pokémon!\nMinha pesquisa ainda não está completa. OK, você venceu."
    },
    "defeat": {
      "1": "Obrigado! Graças à nossa batalha, eu também pude fazer progressos na minha pesquisa!"
    }
  },
  "koga": {
    "encounter": {
      "1": "Fwahahahaha! Pokémon não são apenas sobre força bruta--você verá em breve!"
    },
    "victory": {
      "1": "Ah! Você provou seu valor!"
    },
    "defeat": {
      "1": "Você aprendeu a temer as técnicas do ninja?"
    }
  },
  "bertha": {
    "encounter": {
      "1": "Bem, você mostraria a esta velha senhora o quanto aprendeu?"
    },
    "victory": {
      "1": "Bem! Querida criança, devo dizer, isso foi muito impressionante. \n$Seus Pokémon acreditaram em você e fizeram o melhor para te dar a vitória. \n$Mesmo tendo perdido, me encontro com esse sorriso bobo!"
    },
    "defeat": {
      "1": "Hahahahah! Parece que esta velha senhora ganhou!"
    }
  },
  "lenora": {
    "encounter": {
      "1": "Bem, desafiador, vou pesquisar como você batalha com os Pokémon que criou com tanto carinho!",
      "1_female": "Bem, desafiadora, vou pesquisar como você batalha com os Pokémon que criou com tanto carinho!"
    },
    "victory": {
      "1": "Minha teoria sobre você estava correta. Você é mais do que talentoso… Você é motivado! Eu te saúdo!",
      "1_female": "Minha teoria sobre você estava correta. Você é mais do que talentosa… Você é motivada! Eu te saúdo!"
    },
    "defeat": {
      "1": "Ah ha ha! Se você perder, certifique-se de analisar o porquê e use esse conhecimento na próxima batalha!"
    }
  },
  "siebold": {
    "encounter": {
      "1": "Enquanto eu estiver vivo, continuarei em busca da culinária suprema... e dos oponentes mais fortes em batalha!"
    },
    "victory": {
      "1": "Guardarei minha memória de você e seus Pokémon para sempre em meu coração."
    },
    "defeat": {
      "1": "Nossa batalha Pokémon foi como alimento para minha alma. Isso vai me manter em frente. \n$É assim que vou prestar meus respeitos a você por dar tudo de si na batalha!"
    }
  },
  "roxie": {
    "encounter": {
      "1": "Prepare-se! Vou arrancar algum senso de você!"
    },
    "victory": {
      "1": "Selvagem! Sua razão já é mais tóxica que a minha!"
    },
    "defeat": {
      "1": "Ei, vamos lá! Seja sério! Você tem que dar mais de si!",
      "1_female": "Ei, vamos lá! Seja séria! Você tem que dar mais de si!"
    }
  },
  "olivia": {
    "encounter": {
      "1": "Não precisa de introdução aqui. Hora de batalhar comigo, Olivia!"
    },
    "victory": {
      "1": "Realmente encantador… Tanto você quanto seus Pokémon…"
    },
    "defeat": {
      "1": "Mmm-hmm."
    }
  },
  "poppy": {
    "encounter": {
      "1": "Oooh! Você quer ter uma batalha Pokémon comigo?"
    },
    "victory": {
      "1": "Uagh?! Mmmuuuggghhh…"
    },
    "defeat": {
      "1": "Yaaay! Eu consegui! Eu der-ro-tei você! Você pode vir para… Para… Uma revanche? \n$Venha para uma revanche quando quiser!"
    }
  },
  "agatha": {
    "encounter": {
      "1": "Pokémon são para batalhas! Vou te mostrar como um verdadeiro Treinador batalha!"
    },
    "victory": {
      "1": "Oh meu! Você é algo especial, criança!"
    },
    "defeat": {
      "1": "Bahaha. É assim que uma batalha adequada é feita!"
    }
  },
  "flint": {
    "encounter": {
      "1": "Espero que você esteja aquecido, porque aqui vem o Big Bang!",
      "1_female": "Espero que você esteja aquecida, porque aqui vem o Big Bang!"
    },
    "victory": {
      "1": "Incrível! Seus movimentos são tão quentes que fazem os meus parecerem mornos!"
    },
    "defeat": {
      "1": "Huh? Isso é tudo? Acho que você precisa de um pouco mais de paixão."
    }
  },
  "grimsley": {
    "encounter": {
      "1": "O vencedor leva tudo, e não sobra nada para o perdedor."
    },
    "victory": {
      "1": "Quando se perde, perde-se tudo… A próxima coisa que vou procurar será a vitória, também!"
    },
    "defeat": {
      "1": "Se alguém vence, a pessoa que lutou contra essa pessoa perde."
    }
  },
  "caitlin": {
    "encounter": {
      "1": "Sou eu que apareci quando a flor se abriu. Você que estava esperando…\n$Você parece um Treinador de Pokémon com força refinada e bondade profunda. \n$O que eu procuro no meu oponente é uma força soberba… \n$Por favor, libere seu poder ao máximo!",
      "1_female": "Sou eu que apareci quando a flor se abriu. Você que estava esperando…\n$Você parece uma Treinadora de Pokémon com força refinada e bondade profunda. \n$O que eu procuro no meu oponente é uma força soberba… \n$Por favor, libere seu poder ao máximo!"
    },
    "victory": {
      "1": "Meus Pokémon e eu aprendemos muito! Agradeço a você."
    },
    "defeat": {
      "1": "Aspiro a reivindicar a vitória com elegância e graça."
    }
  },
  "diantha": {
    "encounter": {
      "1": "Batalhar contra você e seus Pokémon, todos vocês cheios de esperança para o futuro… \n$Honestamente, isso apenas me enche da energia que preciso para continuar enfrentando cada novo dia! Sim!"
    },
    "victory": {
      "1": "Testemunhar os espíritos nobres de você e seus Pokémon em batalha realmente tocou meu coração…"
    },
    "defeat": {
      "1": "Oh, fantástico! O que achou? Minha equipe foi bem legal, né?"
    }
  },
  "wikstrom": {
    "encounter": {
      "1": "Bem encontrado, jovem desafiador! Verdadeiramente sou a lâmina famosa de aço endurecido, Duque Wikstrom! \n$Que a batalha comece! En garde!",
      "1_female": "Bem encontrado, jovem desafiadora! Verdadeiramente sou a lâmina famosa de aço endurecido, Duque Wikstrom! \n$Que a batalha comece! En garde!"
    },
    "victory": {
      "1": "Glorioso! A confiança que você compartilha com seu honrado Pokémon supera até mesmo a minha!",
      "1_female": "Gloriosa! A confiança que você compartilha com seu honrado Pokémon supera até mesmo a minha!"
    },
    "defeat": {
      "1": "Que tipo de magia é essa? Meu coração bate incessantemente no meu peito! \n$Vencer contra um oponente tão digno dá asas à minha alma--assim eu voo!",
      "1_female": "Que tipo de magia é essa? Meu coração bate incessantemente no meu peito! \n$Vencer contra uma oponente tão digna dá asas à minha alma--assim eu voo!"
    }
  },
  "acerola": {
    "encounter": {
      "1": "Batalhar é simplesmente divertido! Vamos lá, eu posso te derrotar!"
    },
    "victory": {
      "1": "Eu… Estou sem palavras! Como você conseguiu?!"
    },
    "defeat": {
      "1": "Ehaha! Que vitória incrível!"
    }
  },
  "larry_elite": {
    "encounter": {
      "1": "Olá… Sou eu, Larry.\n$Eu também sou membro da Elite dos Quatro, sim… Infelizmente para mim."
    },
    "victory": {
      "1": "Bem, isso tirou o vento debaixo das nossas asas…"
    },
    "defeat": {
      "1": "É hora de uma reunião com o chefe."
    }
  },
  "lance": {
    "encounter": {
      "1": "Estive esperando por você. Permita-me testar suas habilidades.",
      "2": "Achei que você conseguiria chegar tão longe. Vamos começar."
    },
    "victory": {
      "1": "Você me pegou. Você é magnífico!",
      "1_female": "Você me pegou. Você é magnífica!",
      "2": "Nunca esperei que outro Treinador me derrotasse… Estou surpreso.",
      "2_female": "Nunca esperei que outra Treinadora me derrotasse… Estou surpreso."
    },
    "defeat": {
      "1": "Isso foi por pouco. Quer tentar de novo?",
      "2": "Não é que você seja fraco. Não se incomode com isso.",
      "2_female": "Não é que você seja fraca. Não se incomode com isso."
    }
  },
  "karen": {
    "encounter": {
      "1": "Eu sou Karen. Você gostaria de um duelo com meus Pokémon do tipo Sombrio?",
      "2": "Sou diferente daqueles que você já conheceu.",
      "3": "Você montou uma equipe charmosa. Nossa batalha deve ser boa."
    },
    "victory": {
      "1": "Não! Eu não posso vencer. Como você ficou tão forte?",
      "2": "Não me desviarei do meu caminho escolhido.",
      "3": "O Campeão está ansioso para te conhecer."
    },
    "defeat": {
      "1": "Isso era o que eu esperava.",
      "2": "Bem, isso foi relativamente divertido.",
      "3": "Venha me visitar a qualquer momento."
    }
  },
  "milo": {
    "encounter": {
      "1": "Parece que você entende bem os Pokémon. \n$Isso vai ser uma batalha e tanto! \n$Vou ter que usar a Dynamax no meu Pokémon se eu quiser vencer!"
    },
    "victory": {
      "1": "O poder da Grama murchou… Que desafiador incrível!",
      "1_female": "O poder da Grama murchou… Que desafiadora incrível!"
    },
    "defeat": {
      "1": "Isso realmente vai te deixar em choque e admiração."
    }
  },
  "lucian": {
    "encounter": {
      "1": "Só um momento, por favor. O livro que estou lendo está quase no clímax emocionante… \n$O herói obteve uma espada mística e está prestes a enfrentar sua prova final… Ah, tanto faz. \n$Já que você chegou tão longe, vou deixar isso de lado e batalhar com você. \n$Deixe-me ver se você alcançará tanta glória quanto o herói do meu livro!"
    },
    "victory": {
      "1": "Eu vejo… Parece que você me colocou em xeque-mate."
    },
    "defeat": {
      "1": "Tenho uma reputação a manter."
    }
  },
  "drasna": {
    "encounter": {
      "1": "Você deve ser um Treinador forte. Sim, bastante forte…\n$Isso é uma notícia maravilhosa! Enfrentar oponentes como você e sua equipe fará meus Pokémon crescerem como ervas daninhas!",
      "1_female": "Você deve ser uma Treinadora forte. Sim, bastante forte…\n$Isso é uma notícia maravilhosa! Enfrentar oponentes como você e sua equipe fará meus Pokémon crescerem como ervas daninhas!"
    },
    "victory": {
      "1": "Oh, meu Deus. Isso foi uma batalha rápida… Espero que você volte novamente algum dia!"
    },
    "defeat": {
      "1": "Como isso é possível?"
    }
  },
  "kahili": {
    "encounter": {
      "1": "Então, aqui está você… Por que não vemos para quem os ventos favorecem hoje, você… ou eu?"
    },
    "victory": {
      "1": "É frustrante para mim como membro da Elite dos Quatro, mas parece que sua força é real."
    },
    "defeat": {
      "1": "Essa foi uma jogada de mestre!"
    }
  },
  "hassel": {
    "encounter": {
      "1": "Prepare-se para aprender em primeira mão como é a respiração ardente de uma batalha feroz!"
    },
    "victory": {
      "1": "A sorte sorriu para mim desta vez, mas… \n$Julgando pelo andamento da luta, quem sabe se serei tão sortudo na próxima vez."
    },
    "defeat": {
      "1": "Essa foi uma jogada de mestre!"
    }
  },
  "blue": {
    "encounter": {
      "1": "Você deve ser muito bom para chegar tão longe.",
      "1_female": "Você deve ser muito boa para chegar tão longe."
    },
    "victory": {
      "1": "Só perdi para ele e agora para você… Ele? Hee, hee…"
    },
    "defeat": {
      "1": "Viu? Meu poder é o que me trouxe até aqui."
    }
  },
  "piers": {
    "encounter": {
      "1": "Prepare-se para uma mosh pit comigo e minha galera! Spikemuth, é hora de roquear!"
    },
    "victory": {
      "1": "Eu e minha equipe demos o nosso melhor. Vamos nos encontrar novamente para uma batalha algum dia…"
    },
    "defeat": {
      "1": "Minha garganta está desgastada de tanto gritar… Mas essa foi uma batalha empolgante!"
    }
  },
  "red": {
    "encounter": {
      "1": "…!"
    },
    "victory": {
      "1": "…?"
    },
    "defeat": {
      "1": "…!"
    }
  },
  "jasmine": {
    "encounter": {
      "1": "Oh… Seus Pokémon são impressionantes. Acho que vou gostar disso."
    },
    "victory": {
      "1": "Você é realmente forte. Vou ter que me esforçar muito mais também."
    },
    "defeat": {
      "1": "Eu nunca esperei ganhar."
    }
  },
  "lance_champion": {
    "encounter": {
      "1": "Ainda sou o Campeão. Não vou segurar nada."
    },
    "victory": {
      "1": "Esta é a emergência de um novo Campeão.",
      "1_female": "Esta é a emergência de uma nova Campeã."
    },
    "defeat": {
      "1": "Defendi com sucesso meu Campeonato."
    }
  },
  "steven": {
    "encounter": {
      "1": "Diga-me… O que você viu na sua jornada com seus Pokémon? \n$O que você sentiu, encontrando tantos outros Treinadores por aí? \n$Viajar por esta terra rica… Isso despertou algo dentro de você? \n$Quero que você venha até mim com tudo o que aprendeu. \n$Meus Pokémon e eu responderemos com tudo o que sabemos!"
    },
    "victory": {
      "1": "Então eu, o Campeão, caio em derrota…"
    },
    "defeat": {
      "1": "Esse tempo foi bem gasto! Obrigado!"
    }
  },
  "cynthia": {
    "encounter": {
      "1": "Eu, Cynthia, aceito seu desafio! Não haverá nenhuma trégua da minha parte!"
    },
    "victory": {
      "1": "Não importa o quão divertida a batalha seja, ela sempre terminará algum dia…"
    },
    "defeat": {
      "1": "Mesmo que você perca, nunca perca o amor pelos Pokémon."
    }
  },
  "iris": {
    "encounter": {
      "1": "Sabe de uma coisa? Estou realmente ansiosa para ter batalhas sérias com Treinadores fortes! \n$Quero dizer, vamos lá! Os Treinadores que chegam aqui são Treinadores que desejam a vitória com todas as fibras do seu ser! \n$E eles estão batalhando ao lado de Pokémon que passaram por inúmeras batalhas difíceis! \n$Se eu batalhar com pessoas assim, não só eu ficarei mais forte, meus Pokémon também! \n$E nós vamos nos conhecer ainda melhor! OK! Prepare-se! \n$Sou Iris, a Campeã da Liga Pokémon, e vou te derrotar!"
    },
    "victory": {
      "1": "Aghhhh… Eu dei o meu melhor, mas nós perdemos…"
    },
    "defeat": {
      "1": "Yay! Nós vencemos!"
    }
  },
  "hau": {
    "encounter": {
      "1": "Eu me pergunto se um Treinador batalha de maneira diferente dependendo se ele é de uma região quente ou fria.\n$Vamos testar isso!"
    },
    "victory": {
      "1": "Isso foi incrível! Acho que entendi um pouco melhor seu estilo agora!"
    },
    "defeat": {
      "1": "Cara, essa foi uma batalha e tanto!"
    }
  },
  "geeta": {
    "encounter": {
      "1": "Decidi entrar na batalha mais uma vez. \n$Venha agora… Mostre-me os frutos do seu treinamento."
    },
    "victory": {
      "1": "Estou ansiosa para notícias de todas as suas conquistas!"
    },
    "defeat": {
      "1": "Qual o problema? Isso é tudo?"
    }
  },
  "nemona": {
    "encounter": {
      "1": "Yesss! Estou tão empolgada! Hora de soltar tudo!"
    },
    "victory": {
      "1": "Bem, isso foi ruim, mas ainda me diverti! Eu te pego na próxima!"
    },
    "defeat": {
      "1": "Bem, essa foi uma ótima batalha! Frutífera, com certeza."
    }
  },
  "leon": {
    "encounter": {
      "1": "Vamos ter um tempo absolutamente campeão!"
    },
    "victory": {
      "1": "Meu tempo como Campeão acabou… \n$Mas que tempo campeão foi! \n$Obrigado pela melhor batalha que já tive!"
    },
    "defeat": {
      "1": "Um tempo absolutamente campeão, foi!"
    }
  },
  "whitney": {
    "encounter": {
      "1": "Eai! Você não acha que os Pokémon são, tipo, super fofos?"
    },
    "victory": {
      "1": "Waaah! Waaah! Você é tão mau!",
      "1_female": "Waaah! Waaah! Você é tão má!"
    },
    "defeat": {
      "1": "E é isso!"
    }
  },
  "chuck": {
    "encounter": {
      "1": "Hah! Você quer me desafiar? É corajoso ou apenas ignorante?",
      "1_female": "Hah! Você quer me desafiar? É corajosa ou apenas ignorante?"
    },
    "victory": {
      "1": "Você é forte! Por favor, me faça seu aprendiz?"
    },
    "defeat": {
      "1": "Aí está. Você percebe o quanto sou mais poderoso que você?"
    }
  },
  "katy": {
    "encounter": {
      "1": "Não baixe a guarda, a menos que queira se ver jogado no chão!",
      "1_female": "Não baixe a guarda, a menos que queira se ver jogada no chão!"
    },
    "victory": {
      "1": "Todos os meus adoráveis Pokémon caíram como moscas!"
    },
    "defeat": {
      "1": "Coma, meu adorável Vivillon!"
    }
  },
  "pryce": {
    "encounter": {
      "1": "A juventude sozinha não garante a vitória! Experiência é o que conta."
    },
    "victory": {
      "1": "Excelente! Isso foi perfeito. Tente não esquecer o que sente agora."
    },
    "defeat": {
      "1": "Exatamente como eu imaginei."
    }
  },
  "clair": {
    "encounter": {
      "1": "Você sabe quem eu sou? E ainda se atreve a me desafiar?"
    },
    "victory": {
      "1": "Eu me pergunto até onde você pode ir com seu nível de habilidade. Isso deve ser fascinante."
    },
    "defeat": {
      "1": "E é isso."
    }
  },
  "maylene": {
    "encounter": {
      "1": "Vim desafiá-lo agora e não vou segurar nada. \n$Por favor, prepare-se para a batalha!",
      "1_female": "Vim desafiá-la agora e não vou segurar nada. \n$Por favor, prepare-se para a batalha!"
    },
    "victory": {
      "1": "Eu admito a derrota…"
    },
    "defeat": {
      "1": "Isso foi incrível."
    }
  },
  "fantina": {
    "encounter": {
      "1": "Você vai me desafiar, não é? Mas eu vou ganhar. \n$É o que a Líder do Ginásio de Hearthome faz, não?"
    },
    "victory": {
      "1": "Você é tão incrivelmente forte. Sei porque perdi."
    },
    "defeat": {
      "1": "Estou tão, tão, muito feliz!"
    }
  },
  "byron": {
    "encounter": {
      "1": "Treinador! Você é jovem, assim como meu filho, Roark. \n$Com mais Treinadores jovens assumindo o comando, o futuro dos Pokémon é brilhante! \n$Então, como uma parede para os jovens, aceitarei seu desafio!",
      "1_female": "Treinadora! Você é jovem, assim como meu filho, Roark. \n$Com mais Treinadores jovens assumindo o comando, o futuro dos Pokémon é brilhante! \n$Então, como uma parede para os jovens, aceitarei seu desafio!"
    },
    "victory": {
      "1": "Hmm! Meus Pokémon robustos--derrotados!"
    },
    "defeat": {
      "1": "Gwahahaha! Como foram meus Pokémon robustos?!"
    }
  },
  "olympia": {
    "encounter": {
      "1": "Um costume antigo decidindo o destino de alguém. A batalha começa!"
    },
    "victory": {
      "1": "Crie seu próprio caminho. Não deixe nada te atrapalhar. Seu destino, seu futuro."
    },
    "defeat": {
      "1": "Nosso caminho está claro agora."
    }
  },
  "volkner": {
    "encounter": {
      "1": "Já que você chegou tão longe, deve ser bastante forte…\n$Espero que você seja o Treinador que me faça lembrar como é divertido batalhar!",
      "1_female": "Já que você chegou tão longe, deve ser bastante forte…\n$Espero que você seja a Treinadora que me faça lembrar como é divertido batalhar!"
    },
    "victory": {
      "1": "Você me venceu…\n$Seu desejo e a maneira nobre como seus Pokémon batalharam por você… \n$Eu até me senti emocionado durante nossa luta. Foi uma batalha muito boa."
    },
    "defeat": {
      "1": "Não foi nada chocante…\n$Isso não é o que eu queria!"
    }
  },
  "burgh": {
    "encounter": {
      "1": "M'hm… Se eu ganhar esta batalha, sinto que posso desenhar um quadro diferente de qualquer outro. \n$OK! Posso ouvir minha musa da batalha claramente. Vamos direto ao ponto!",
      "2": "Claro, estou realmente orgulhoso de todos os meus Pokémon! \n$Bem agora… Vamos direto ao ponto!"
    },
    "victory": {
      "1": "Acabou? Minha musa me abandonou?",
      "2": "Hmm… Acabou! Você é incrível!"
    },
    "defeat": {
      "1": "Uau… É bonito de alguma forma, não é…",
      "2": "Às vezes ouço as pessoas dizerem que foi uma vitória feia. \n$Acho que se você está dando o seu melhor, qualquer vitória é bonita."
    }
  },
  "elesa": {
    "encounter": {
      "1": "C'est fini! Quando tenho certeza disso, sinto um choque elétrico percorrer meu corpo! \n$Quero sentir essa sensação, então agora meus amados Pokémon vão fazer sua cabeça girar!"
    },
    "victory": {
      "1": "Eu queria fazer sua cabeça girar, mas você me surpreendeu."
    },
    "defeat": {
      "1": "Isso foi insatisfatório de alguma forma… Você dará tudo de si na próxima vez?"
    }
  },
  "skyla": {
    "encounter": {
      "1": "Finalmente é hora do confronto! Isso significa a batalha Pokémon que decide quem está no topo, certo? \n$Eu amo estar no topo! Porque você pode ver para sempre e sempre de lugares altos! \n$Então, que tal nós nos divertirmos?"
    },
    "victory": {
      "1": "Ser seu oponente na batalha é uma nova fonte de força para mim. Obrigada!"
    },
    "defeat": {
      "1": "Ganhar ou perder, você sempre ganha algo com uma batalha, certo?"
    }
  },
  "brycen": {
    "encounter": {
      "1": "Há também força em estar com outras pessoas e Pokémon. \n$Receber o apoio deles te fortalece. Vou te mostrar esse poder!"
    },
    "victory": {
      "1": "A maravilhosa combinação de você e seus Pokémon! Que amizade linda!"
    },
    "defeat": {
      "1": "Condições extremas realmente testam e treinam você!"
    }
  },
  "drayden": {
    "encounter": {
      "1": "O que eu quero encontrar é um jovem Treinador que possa me mostrar um futuro brilhante. \n$Vamos batalhar com tudo o que temos: sua habilidade, minha experiência e o amor com que criamos nossos Pokémon!"
    },
    "victory": {
      "1": "Esse sentimento intenso que me invade após uma derrota… Não sei como descrevê-lo."
    },
    "defeat": {
      "1": "Harrumph! Sei que sua habilidade é maior que isso!"
    }
  },
  "grant": {
    "encounter": {
      "1": "Só há uma coisa que desejo. \n$Que, superando um ao outro, encontremos um caminho para alturas ainda maiores."
    },
    "victory": {
      "1": "Você é uma parede que não consigo superar!"
    },
    "defeat": {
      "1": "Não desista. \n$Isso é tudo o que realmente importa. \n$As lições mais importantes da vida são simples."
    }
  },
  "korrina": {
    "encounter": {
      "1": "Hora da grande aparição de Lady Korrina!"
    },
    "victory": {
      "1": "É o seu próprio ser que permite que seus Pokémon evoluam!"
    },
    "defeat": {
      "1": "Que batalha explosiva!"
    }
  },
  "clemont": {
    "encounter": {
      "1": "Oh! Estou feliz por termos nos encontrado!"
    },
    "victory": {
      "1": "Sua paixão pela batalha me inspira!"
    },
    "defeat": {
      "1": "Parece que minha Máquina Treinadora-Crescer-Forte, Mach 2 está realmente funcionando!"
    }
  },
  "valerie": {
    "encounter": {
      "1": "Oh, se não é um jovem Treinador… É adorável conhecê-lo assim. \n$Então, suponho que você ganhou o direito a uma batalha, como recompensa por seus esforços. \n$Uma elusiva Fada pode parecer frágil como a brisa e delicado como uma flor, mas é forte.",
      "1_female": "Oh, se não é uma jovem Treinadora… É adorável conhecê-la assim. \n$Então, suponho que você ganhou o direito a uma batalha, como recompensa por seus esforços. \n$Uma elusiva Fada pode parecer frágil como a brisa e delicado como uma flor, mas é forte."
    },
    "victory": {
      "1": "Espero que você encontre coisas para sorrir amanhã…"
    },
    "defeat": {
      "1": "Oh meu Deus, que pena…"
    }
  },
  "wulfric": {
    "encounter": {
      "1": "Sabe de uma coisa? Todos falamos muito sobre o que você aprende com as batalhas e os laços e tudo mais…\n$Mas realmente, eu só faço isso porque é divertido. \n$Quem se importa com o grandioso? Vamos batalhar!"
    },
    "victory": {
      "1": "Incrível! Sou duro como um iceberg, mas você me quebrou por completo!"
    },
    "defeat": {
      "1": "Lute comigo e é isso que acontece!"
    }
  },
  "kabu": {
    "encounter": {
      "1": "Todo Treinador e Pokémon treina duro em busca da vitória. \n$Mas isso significa que seu oponente também está se esforçando para vencer. \n$No final, a partida é decidida por qual lado é capaz de liberar seu verdadeiro potencial."
    },
    "victory": {
      "1": "Estou feliz por poder lutar com você hoje!"
    },
    "defeat": {
      "1": "É uma ótima maneira de sentir meu próprio crescimento!"
    }
  },
  "bea": {
    "encounter": {
      "1": "Você tem um espírito inabalável que não será movido, não importa como você seja atacado? \n$Acho que vou testar isso, certo?"
    },
    "victory": {
      "1": "Senti o espírito de luta de seus Pokémon enquanto você os liderava na batalha."
    },
    "defeat": {
      "1": "Essa foi a melhor partida que alguém poderia esperar."
    }
  },
  "opal": {
    "encounter": {
      "1": "Deixe-me ver como você e seu Pokémon parceiro se comportam!"
    },
    "victory": {
      "1": "Seu rosa ainda está faltando, mas você é um Treinador excelente com Pokémon excelentes.",
      "1_female": "Seu rosa ainda está faltando, mas você é uma Treinadora excelente com Pokémon excelentes."
    },
    "defeat": {
      "1": "Muito ruim para você, eu acho."
    }
  },
  "bede": {
    "encounter": {
      "1": "Suponho que devo provar além de qualquer dúvida o quão patético você é e quão forte eu sou.",
      "1_female": "Suponho que devo provar além de qualquer dúvida o quão patética você é e quão forte eu sou."
    },
    "victory": {
      "1": "Eu vejo… Bem, tudo bem. Eu não estava me esforçando muito de qualquer maneira."
    },
    "defeat": {
      "1": "Bom trabalho, eu suponho."
    }
  },
  "gordie": {
    "encounter": {
      "1": "Então, vamos acabar com isso."
    },
    "victory": {
      "1": "Eu só quero me enterrar em um buraco… Bem, acho que seria mais como cair daqui."
    },
    "defeat": {
      "1": "Batalhe como sempre faz, a vitória seguirá!"
    }
  },
  "marnie": {
    "encounter": {
      "1": "A verdade é que, quando tudo está dito e feito… Eu realmente só quero me tornar Campeã por mim mesma! \n$Então, não leve para o pessoal quando eu chutar seu traseiro!"
    },
    "victory": {
      "1": "OK, então eu perdi… Mas consegui ver muitos dos pontos bons de você e seus Pokémon!"
    },
    "defeat": {
      "1": "Espero que você tenha gostado das nossas táticas de batalha."
    }
  },
  "raihan": {
    "encounter": {
      "1": "Vou derrotar o Campeão, vencer todo o torneio e provar ao mundo o quão forte o grande Raihan realmente é!"
    },
    "victory": {
      "1": "Eu pareço bem mesmo quando perco. \n$É uma verdadeira maldição. \n$Acho que é hora de mais uma selfie!"
    },
    "defeat": {
      "1": "Vamos tirar uma selfie para lembrar disso."
    }
  },
  "brassius": {
    "encounter": {
      "1": "Pressuponho que você está pronto? Que nossa obra de arte colaborativa comece!",
      "1_female": "Pressuponho que você está pronta? Que nossa obra de arte colaborativa comece!"
    },
    "victory": {
      "1": "Ahhh…avant-garde!"
    },
    "defeat": {
      "1": "Começarei uma nova peça imediatamente!"
    }
  },
  "iono": {
    "encounter": {
      "1": "Como você está se sentindo sobre esta batalha?\n$...\n$Vamos começar o show! Quão forte é o nosso desafiador? \n$Eu não sei! Vamos descobrir juntos!",
      "1_female": "Como você está se sentindo sobre esta batalha?\n$...\n$Vamos começar o show! Quão forte é o nossa desafiadora? \n$Eu não sei! Vamos descobrir juntos!"
    },
    "victory": {
      "1": "Você é tão chamativo e brilhante quanto um Raio do Trovão de 10.000.000 volts, amigo!",
      "1_female": "Você é tão chamativa e brilhante quanto um Raio do Trovão de 10.000.000 volts, amiga!"
    },
    "defeat": {
      "1": "Seus olhos são MEUS!"
    }
  },
  "larry": {
    "encounter": {
      "1": "Quando tudo está dito e feito, a simplicidade é mais forte."
    },
    "victory": {
      "1": "Uma porção de derrota, hein?"
    },
    "defeat": {
      "1": "Vou encerrar o dia."
    }
  },
  "ryme": {
    "encounter": {
      "1": "Vamos lá, baby! Me agite até os ossos!"
    },
    "victory": {
      "1": "Você é legal, meu amigo, você move minha ALMA!",
      "1_female": "Você é legal, minha amiga, você move minha ALMA!"
    },
    "defeat": {
      "1": "Até mais, baby!"
    }
  },
  "grusha": {
    "encounter": {
      "1": "Tudo o que preciso fazer é garantir que o poder do meu Pokémon te arrependa até os ossos!"
    },
    "victory": {
      "1": "Sua paixão ardente... Eu meio que gosto, para ser honesto."
    },
    "defeat": {
      "1": "As coisas não esquentaram para você."
    }
  },
  "marnie_elite": {
    "encounter": {
      "1": "Você chegou até aqui, hein? Vamos ver se você pode lidar com meus Pokémon!",
      "2": "Vou dar o meu melhor, mas não pense que vou pegar leve com você!"
    },
    "victory": {
      "1": "Não acredito que perdi... Mas você mereceu essa vitória. Bem feito!",
      "2": "Parece que ainda tenho muito a aprender. Porém, grande batalha!"
    },
    "defeat": {
      "1": "Você lutou bem, mas eu tenho a vantagem! Melhor sorte na próxima vez!",
      "2": "Parece que meu treinamento valeu a pena. Obrigado pela batalha!"
    }
  },
  "nessa_elite": {
    "encounter": {
      "1": "As marés estão mudando a meu favor. Pronto para ser levado pela corrente?",
      "1_female": "As marés estão mudando a meu favor. Pronta para ser levada pela corrente?",
      "2": "Vamos fazer ondas com esta batalha! Espero que esteja preparado!",
      "2_female": "Vamos fazer ondas com esta batalha! Espero que esteja preparada!"
    },
    "victory": {
      "1": "Você navegou nessas águas perfeitamente... Bem feito!",
      "2": "Parece que minhas correntes não foram páreo para você. Bom trabalho!"
    },
    "defeat": {
      "1": "A água sempre encontra um caminho. Essa foi uma batalha refrescante!",
      "2": "Você lutou bem, mas o poder do oceano é imparável!"
    }
  },
  "bea_elite": {
    "encounter": {
      "1": "Prepare-se! Meu espírito de luta brilha intensamente!",
      "2": "Vamos ver se você consegue acompanhar meu ritmo implacável!"
    },
    "victory": {
      "1": "Sua força... É impressionante. Você realmente merece essa vitória.",
      "2": "Nunca senti essa intensidade antes. Trabalho incrível!"
    },
    "defeat": {
      "1": "Outra vitória para meu rigoroso regime de treinamento! Bem feito!",
      "2": "Você tem força, mas eu treinei mais. Grande batalha!"
    }
  },
  "allister_elite": {
    "encounter": {
      "1": "As sombras caem... Você está pronto para enfrentar seus medos?",
      "1_female": "As sombras caem... Você está pronta para enfrentar seus medos?",
      "2": "Vamos ver se você pode lidar com a escuridão que eu comando."
    },
    "victory": {
      "1": "Você dissipou as sombras... Por enquanto. Bem feito.",
      "2": "Sua luz atravessou minha escuridão. Ótimo trabalho."
    },
    "defeat": {
      "1": "As sombras falaram... Sua força não é suficiente.",
      "2": "A escuridão triunfa... Talvez na próxima vez você veja a luz."
    }
  },
  "raihan_elite": {
    "encounter": {
      "1": "Tempestade se formando! Vamos ver se você aguenta essa luta!",
      "2": "Prepare-se para enfrentar o olho da tempestade!"
    },
    "victory": {
      "1": "Você enfrentou a tempestade... Trabalho incrível!",
      "2": "Você navegou nos ventos perfeitamente... Grande batalha!"
    },
    "defeat": {
      "1": "Outra tempestade enfrentada, outra vitória conquistada! Bem lutado!",
      "2": "Você foi pego na minha tempestade! Melhor sorte na próxima vez!",
      "2_female": "Você foi pega na minha tempestade! Melhor sorte na próxima vez!"
    }
  },
  "alder": {
    "encounter": {
      "1": "Se prepare para uma batalha contra o Treinador mais forte de Unova!"
    },
    "victory": {
      "1": "Muito bem! Você certamente é um talento incomparável."
    },
    "defeat": {
      "1": "Um vento fresco sopra em meu coração...\n$Que esforço extraordinário!"
    }
  },
  "kieran": {
    "encounter": {
      "1": "Através do trabalho duro, eu me torno cada vez mais forte!\n$Eu não perco."
    },
    "victory": {
      "1": "Eu não acredito...\n$Que batalha divertida e emocionante!"
    },
    "defeat": {
      "1": "Uau, que batalha!\n$Hora de você treinar ainda mais."
    }
  },
  "rival": {
    "encounter": {
      "1": "@c{smile}Eai, estava procurando você! Sabia que você estava ansioso para começar, mas esperava pelo menos um tchau…\n$@c{smile_eclosed}Então você está realmente perseguindo seu sonho, hein?\n Quase não consigo acreditar.\n$@c{serious_smile_fists}Já que estamos aqui, que tal uma batalha?\nAfinal, quero ter certeza de que você está pronto.\n$@c{serious_mopen_fists}Não se segure, quero que você dê tudo de si!"
    },
    "victory": {
      "1": "@c{shock}Caramba… Você me limpou.\nVocê é mesmo um novato?\n$@c{smile}Talvez tenha sido um pouco de sorte, mas…\nQuem sabe você consiga chegar até o fim.\n$Aliás, o professor me pediu para te dar esses itens. Eles parecem bem legais.\n$@c{serious_smile_fists}Boa sorte lá fora!"
    }
  },
  "rival_female": {
    "encounter": {
      "1": "@c{smile_wave}Aí está você! Procurei você em todo lugar!\n@c{angry_mopen}Esqueceu de se despedir da sua melhor amiga?\n$@c{smile_ehalf}Você está indo atrás do seu sonho, né?\nEsse dia realmente chegou, não é…\n$@c{smile}Enfim, vou te perdoar por ter me esquecido, mas com uma condição. @c{smile_wave_wink}Você tem que lutar comigo!\n$@c{angry_mopen}Dê o seu melhor! Não quer que sua aventura acabe antes de começar, né?"
    },
    "victory": {
      "1": "@c{shock}Você acabou de começar e já está tão forte?!@d{96}\n@c{angry}Você trapaceou, não foi?\n$@c{smile_wave_wink}Brincadeirinha!@d{64} @c{smile_eclosed}Eu perdi de forma justa… Tenho a sensação de que você vai se sair muito bem lá fora.\n$@c{smile}Aliás, o professor pediu para eu te dar alguns itens. Espero que sejam úteis!\n$@c{smile_wave}Dê o seu melhor, como sempre! Eu acredito em você!"
    }
  },
  "rival_2": {
    "encounter": {
      "1": "@c{smile}Eai, você também está aqui?\n@c{smile_eclosed}Ainda com um recorde perfeito, hein…?\n$@c{serious_mopen_fists}Sei que parece que eu te segui até aqui, mas isso não é totalmente verdade.\n$@c{serious_smile_fists}Sinceramente, tenho estado ansioso por uma revanche desde que você me venceu em casa.\n$Tenho treinado bastante, então vou dar uma luta difícil desta vez.\n$@c{serious_mopen_fists}Não se segure, assim como antes!\nVamos lá!"
    },
    "victory": {
      "1": "@c{neutral_eclosed}Ah. Acho que fui confiante demais.\n$@c{smile}Tudo bem, no entanto. Eu imaginei que isso poderia acontecer.\n@c{serious_mopen_fists}Isso só significa que preciso me esforçar mais para a próxima vez!\n\n$@c{smile}Ah, não que você precise realmente de ajuda, mas eu tinha um extra desses itens e pensei que você poderia querer.\n$@c{serious_smile_fists}Não espere outro depois deste!\nNão posso continuar dando vantagem ao meu oponente.\n$@c{smile}Enfim, cuide-se, e aproveite o evento!"
    }
  },
  "rival_2_female": {
    "encounter": {
      "1": "@c{smile_wave}Oh, que surpresa te encontrar aqui. Parece que você ainda está invicto. @c{angry_mopen}Hum… Nada mal!\n$@c{angry_mopen}Eu sei o que você está pensando, e não, eu não estava te espionando. @c{smile_eclosed}Acontece que eu estava na área.\n$@c{smile_ehalf}Estou feliz por você, mas só quero te avisar que está tudo bem perder às vezes.\n$@c{smile}Aprendemos com nossos erros, muitas vezes mais do que se continuássemos vencendo.\n$@c{angry_mopen}De qualquer forma, tenho treinado duro para nossa revanche, então é melhor você dar o seu melhor!"
    },
    "victory": {
      "1": "@c{neutral}Eu… não era para eu perder dessa vez…\n$@c{smile}Ah bem. Isso só significa que vou ter que treinar ainda mais para a próxima vez!\n$@c{smile_wave}Também consegui mais dois desses para você!\n@c{smile_wave_wink}Não precisa me agradecer~.\n$@c{angry_mopen}Estes são os últimos, hein! Você não vai ganhar mais nenhum presente de mim depois desse!\n$@c{smile_wave}Continue assim, e aproveite o evento!"
    },
    "defeat": {
      "1": "Está tudo bem perder às vezes…"
    }
  },
  "rival_3": {
    "encounter": {
      "1": "@c{smile}Eai, olha quem é! Faz um tempo.\n@c{neutral}Você… ainda está invicto? Hum.\n$@c{neutral_eclosed}As coisas têm sido meio… estranhas.\nNão é a mesma coisa em casa sem você.\n$@c{serious}Eu sei que é egoísta, mas preciso desabafar.\n@c{neutral_eclosed}Acho que você está se metendo em algo grande demais aqui.\n$@c{serious}Nunca perder é irrealista.\nPrecisamos perder às vezes para crescer.\n$@c{neutral_eclosed}Você teve uma grande jornada, mas ainda há muito pela frente, e só vai ficar mais difícil. @c{neutral}Você está preparado para isso?\n$@c{serious_mopen_fists}Se sim, prove para mim."
    },
    "victory": {
      "1": "@c{angry_mhalf}Isso é ridículo… Eu mal parei de treinar…\nComo ainda estamos tão distantes?"
    }
  },
  "rival_3_female": {
    "encounter": {
      "1": "@c{smile_wave}Quanto tempo! Ainda não perdeu, né.\n@c{angry}Você está começando a me irritar. @c{smile_wave_wink}Brincadeirinha!\n$@c{smile_ehalf}Mas sério, você não sente saudades de casa? Ou… de mim?\nEu… Eu quero dizer, sentimos muito a sua falta.\n$@c{smile_eclosed}Eu apoio o seu sonho e tudo mais, mas a realidade é que você vai perder mais cedo ou mais tarde.\n$@c{smile}E quando isso acontecer, estarei lá para você, como sempre.\n@c{angry_mopen}Agora, deixe-me mostrar o quão forte eu me tornei!"
    },
    "victory": {
      "1": "@c{shock}Depois de tudo isso… não foi o suficiente…?\nVocê nunca vai voltar a esse ritmo…"
    },
    "defeat": {
      "1": "Você deu o seu melhor, agora vamos para casa."
    }
  },
  "rival_4": {
    "encounter": {
      "1": "@c{neutral}Oi.\n$Não vou enrolar com você.\n@c{neutral_eclosed}Estou aqui para vencer, simples assim.\n$@c{serious_mhalf_fists}Aprendi a maximizar meu potencial dedicando todo o meu tempo ao treino.\n$@c{smile}Você ganha muito tempo extra quando corta o sono e a interação social desnecessários.\n$@c{serious_mopen_fists}Nada disso importa mais, não até eu vencer.\n$@c{neutral_eclosed}Cheguei ao ponto de não perder mais.\n@c{smile_eclosed}Acho que sua filosofia não estava tão errada afinal.\n$@c{angry_mhalf}Perder é para os fracos, e eu não sou mais fraco.\n$@c{serious_mopen_fists}Prepare-se."
    },
    "victory": {
      "1": "@c{neutral}O que…@d{64} O que é você?"
    }
  },
  "rival_4_female": {
    "encounter": {
      "1": "@c{neutral}Sou eu! Você não esqueceu de mim de novo… esqueceu?\n$@c{smile}Você deveria se orgulhar de até onde chegou. Parabéns!\nMas parece que é o fim da sua jornada.\n$@c{smile_eclosed}Você despertou algo em mim que eu nunca soube que existia.\nParece que agora tudo o que faço é treinar.\n$@c{smile_ehalf}Eu mal como ou durmo agora, só treino meus Pokémon o dia todo, ficando mais forte a cada vez.\n$@c{neutral}Na verdade, eu… mal me reconheço.\n$E agora, finalmente atingi o desempenho máximo.\nNão acho que alguém poderia me vencer agora.\n$E sabe de uma coisa? É tudo por sua causa.\n@c{smile_ehalf}Eu não sei se te agradeço ou te odeio.\n$@c{angry_mopen}Prepare-se."
    },
    "victory": {
      "1": "@c{neutral}O que…@d{64} O que é você?"
    },
    "defeat": {
      "1": "$@c{smile}Você deveria se orgulhar de até onde chegou."
    }
  },
  "rival_5": {
    "encounter": {
      "1": "@c{neutral}…"
    },
    "victory": {
      "1": "@c{neutral}…"
    }
  },
  "rival_5_female": {
    "encounter": {
      "1": "@c{neutral}…"
    },
    "victory": {
      "1": "@c{neutral}…"
    },
    "defeat": {
      "1": "$@c{smile_ehalf}…"
    }
  },
  "rival_6": {
    "encounter": {
      "1": "@c{smile_eclosed}Nos encontramos de novo.\n$@c{neutral}Tive um tempo para refletir sobre tudo isso.\nHá uma razão para tudo isso parecer tão estranho.\n$@c{neutral_eclosed}Seu sonho, minha vontade de te vencer…\nTudo faz parte de algo maior.\n$@c{serious}Isso não é sobre mim, nem sobre você… É sobre o mundo, @c{serious_mhalf_fists}e é meu propósito te levar ao limite.\n$@c{neutral_eclosed}Se cumpri esse propósito, não posso dizer, mas fiz tudo ao meu alcance.\n$@c{neutral}Este lugar em que acabamos é assustador… Mas de alguma forma me sinto indiferente, como se já tivesse estado aqui antes.\n$@c{serious_mhalf_fists}Você sente o mesmo, não sente?\n$@c{serious}…é como se algo aqui estivesse falando comigo.\nIsso é tudo o que o mundo conhece há muito tempo.\n$Aqueles momentos que apreciamos juntos que parecem tão recentes não passam de uma memória distante.\n$@c{neutral_eclosed}Quem pode dizer se eles foram realmente reais em primeiro lugar.\n$@c{serious_mopen_fists}Você precisa continuar empurrando, porque se não o fizer, isso nunca vai acabar. Você é o único que pode fazer isso.\n$@c{serious_smile_fists}Eu mal sei o que tudo isso significa, só sei que é verdade.\n$@c{serious_mopen_fists}Se você não pode me derrotar aqui e agora, você não terá chance."
    },
    "victory": {
      "1": "@c{smile_eclosed}Parece que meu trabalho aqui está feito.\n$Quero que você me prometa uma coisa.\n@c{smile}Depois que curar o mundo, por favor, volte para casa."
    }
  },
  "rival_6_female": {
    "encounter": {
      "1": "@c{smile_ehalf}Então somos só nós de novo.\n$@c{smile_eclosed}Sabe, continuo pensando nisso…\n$@c{smile_ehalf}Há algo nisso tudo, por que tudo parece tão estranho agora…\n$@c{smile}Você tem seu sonho, e eu tenho essa ambição em mim…\n$Não consigo evitar sentir que há um propósito maior em tudo isso, no que estamos fazendo, você e eu.\n$@c{smile_eclosed}Acho que devo te levar ao limite.\n$@c{smile_ehalf}Não tenho certeza se estou fazendo um bom trabalho nisso, mas tentei meu melhor até agora.\n$Há algo neste lugar estranho e terrível… Tudo parece tão claro…\n$Isso… é tudo o que o mundo conhece há muito tempo.\n$@c{smile_eclosed}É como se eu mal pudesse lembrar das memórias que apreciamos juntos.\n$@c{smile_ehalf}Elas foram reais? Elas parecem tão distantes agora…\n$@c{angry_mopen}Você precisa continuar empurrando, porque se não o fizer, isso nunca vai acabar. Você é o único que pode fazer isso.\n$@c{smile_ehalf}Eu… não sei o que tudo isso significa… mas sinto que é verdade.\n$@c{neutral}Se você não pode me derrotar aqui e agora, você não terá chance."
    },
    "victory": {
      "1": "@c{smile_ehalf}Eu… acho que cumpri meu propósito…\n$@c{smile_eclosed}Prometa-me… Depois que curar o mundo… Por favor… volte para casa.\n$@c{smile_ehalf}…Obrigada."
    }
  }
}
