import { BerryTranslationEntries } from "#app/interfaces/locales";

export const berry: BerryTranslationEntries = {
  "SITRUS": {
    "name": "เบอร์รี่ซิตรัส",
    "effect": "ฟื้นฟู HP 25% หาก HP ต่ำกว่า 50%"
  },
  "LUM": {
    "name": "เบอร์รี่ลัม",
    "effect": "รักษาสภาวะที่เป็นไปไม่ได้และความสับสน"
  },
  "ENIGMA": {
    "name": "เบอร์รี่อินิกมา",
    "effect": "ฟื้นฟู HP 25% หากโดนโจมตีด้วยการโจมตีที่มีประสิทธิภาพสูง"
  },
  "LIECHI": {
    "name": "เบอร์รี่ลีชิ",
    "effect": "เพิ่มพลังโจมตีหาก HP ต่ำกว่า 25%"
  },
  "GANLON": {
    "name": "เบอร์รี่แกนลอน",
    "effect": "เพิ่มพลังป้องกันหาก HP ต่ำกว่า 25%"
  },
  "PETAYA": {
    "name": "เบอร์รี่เพทายา",
    "effect": "เพิ่มพลังโจมตีพิเศษหาก HP ต่ำกว่า 25%"
  },
  "APICOT": {
    "name": "เบอร์รี่อาพิคอท",
    "effect": "เพิ่มพลังป้องกันพิเศษหาก HP ต่ำกว่า 25%"
  },
  "SALAC": {
    "name": "เบอร์รี่ซาแลค",
    "effect": "เพิ่มความเร็วหาก HP ต่ำกว่า 25%"
  },
  "LANSAT": {
    "name": "เบอร์รี่แลนแซท",
    "effect": "เพิ่มอัตราการโจมตีคริติคอลหาก HP ต่ำกว่า 25%"
  },
  "STARF": {
    "name": "เบอร์รี่สตาร์ฟ",
    "effect": "เพิ่มพลังของสถานะแบบสุ่มหาก HP ต่ำกว่า 25%"
  },
  "LEPPA": {
    "name": "เบอร์รี่เลปปา",
    "effect": "ฟื้นฟู PP 10 ครั้งให้กับท่าโจมตีหาก PP ลดลงเป็น 0"
  },
} as const;
