import { SimpleTranslationEntries } from "#app/interfaces/locales";

export const tutorial: SimpleTranslationEntries = {
  "intro": `ยินดีต้อนรับสู่ PokéRogue! เกมแฟนโฟกัสที่เน้นการต่อสู้โปเกมอนพร้อมคุณลักษณะของเกมแนวโรแกไลท์
    $เกมนี้ไม่ได้มีการค้าขายและเราไม่เคยขอเสียจากระบบเนื้อหาที่ขอใช้สิทธิ์
    $เกมกำลังพัฒนาอยู่ แต่สามารถเล่นได้แบบเต็มรูปแบบ
    \nสำหรับรายงานข้อผิดพลาด โปรดใช้ชุมชน Discord
    $หากเกมทำงานช้า โปรดตรวจสอบให้แน่ใจว่า 'การเร่งฮาร์ดแวร์' ถูกเปิดใช้งานในการตั้งค่าเบราว์เซอร์ของคุณ`,

  "accessMenu": "เพื่อเข้าถึงเมนู กด M หรือ Escape ขณะที่กำลังรอให้ป้อน\nเมนูมีตัวเลือกการตั้งค่าและคุณสมบัติต่างๆ",

  "menu": `จากเมนูนี้คุณสามารถเข้าถึงการตั้งค่า
    $จากการตั้งค่าคุณสามารถเปลี่ยนความเร็วของเกม รูปแบบหน้าต่าง และตัวเลือกอื่นๆ
    $ยังมีคุณสมบัติอื่นๆ ที่นี่ด้วย ดังนั้นอย่าลืมตรวจสอบทั้งหมด!`,

  "starterSelect": `จากหน้าจอนี้คุณสามารถเลือกสตาร์ทเตอร์ของคุณได้โดยการกด\nZ หรือ Space bar พวกเขาคือสมาชิกพรรคแรกของคุณ
    $แต่ละสตาร์ทเตอร์มีค่า ทีมของคุณสามารถมีสูงสุด\n6 สมาชิก ตามที่ทั้งหมดไม่เกิน 10
    $คุณยังสามารถเลือกเพศ ความสามารถ และรูปแบบตาม\nแบบที่คุณได้จับหรือฟักได้
    $IV สำหรับชนิด คือดีที่สุดของทุกคนที่คุณจับหรือฟักได้ ดังนั้นลองจับมันมากๆ!`,

  "pokerus": `ประจำวันสุ่ม 3 สตาร์ทเตอร์ที่เลือกได้มีกรอบสีม่วง
    $หากคุณเห็นสตาร์ทเตอร์ที่คุณเป็นเจ้าของมีหนึ่งในนี้\nลองเพิ่มลงในทีมของคุณ โปรดตรวจสอบสรุปของมัน!`,

  "statChange": `การเปลี่ยนแปลงสถานะจะยังคงอยู่ตลอดการต่อสู้ไม่ว่าโปเกมอนของคุณจะถูกเรียกกลับ
    $โปเกมอนของคุณจะถูกเรียกกลับก่อนการต่อสู้กับนักฝึกหัดและก่อนเข้าไปในชุมชนใหม่
    $คุณสามารถดูการเปลี่ยนแปลงสถานะสำหรับโปเกมอนใดๆ บนสนามโดยกด C หรือ Shift
    $คุณยังสามารถดูชุดท่าทางสำหรับโปเกมอนศัตรูได้โดยกด V
    $สิ่งนี้เฉพาะการเปิดเผยท่าทางที่คุณเห็นโปเกมอนใช้ในการต่อสู้นี้เท่านั้น`,

  "selectItem": `หลังจากทุกการต่อสู้ คุณจะได้รับตัวเลือกของไอเท็มสุ่ม 3 รายการ
    $คุณสามารถเลือกได้เพียงหนึ่งรายการ
    $เหล่านี้ครอบคลุมตั้งแต่ไอเท็มที่ใช้ได้ ไปยังโปเกมอนไอเทมถือ ไปยังไอเท็มถาวร
    $เฉพาะผลกระทบของไอเท็มที่ไม่ใช่ที่ใช้ได้จะสะสมได้ในวิธีการต่างๆ
    $บางรายการจะปรากฏเท่านั้นถ้าพวกเขาสามารถใช้ได้ เช่น ไอเท็มวิวัฒนาการ
    $คุณยังสามารถโอนไอเท็มถือระหว่างโปเกมอนโดยใช้ตัวเลือกการโอน
    $ตัวเลือกการโอนจะปรากฏทางด้านล่างขวาเมื่อคุณได้รับไอเท็มที่ถือ
    $คุณสามารถซื้อไอเท็มที่ใช้ได้ด้วยเงิน และความหลากหลายจะมีมากขึ้นเมื่อคุณไปได้ไกล
    $โปรดระวังที่จะซื้อเหล่านี้ก่อนที่คุณจะเลือกรายการสุ่ม เนื่องจากจะก้าวหน้าไปยังการต่อสู้ครั้งถัดไปหลังจากนั้น`,

  "eggGacha": `จากหน้าจอนี้ คุณสามารถแลกบัตรกำนัลของคุณเป็น\nไข่โปเกมอนได้
  $ไข่จะต้องฟักออกมาและเข้าใกล้การฟักมากขึ้นหลัง\nทุกการต่อสู้ ไข่ที่หายากจะใช้เวลาฟักนานกว่า
  $โปเกมอนที่จับแล้วจะไม่ถูกเพิ่มเข้าไปในปาร์ตี้ของคุณ แต่จะ\nถูกเพิ่มเข้าไปในสตาร์ทเตอร์ของคุณ
  $โปเกมอนที่ฟักออกมาจากไข่ โดยทั่วไปแล้วจะมี IV ที่ดีกว่า\nโปเกมอนป่า
  $โปเกมอนบางตัวสามารถหาได้จากไข่เท่านั้น
  $มีเครื่องที่แตกต่างกัน 3 เครื่องให้ดึงออกมาพร้อม\nโบนัสที่แตกต่างกัน ดังนั้นเลือกเครื่องที่เหมาะกับคุณที่สุด!`,
} as const;
